/*
 * @WNMS国庆纪念币购物 
 * @聊天名片物品
 */
//---------变量区-------
var 红色箭头 = "#fUI/UIWindow.img/PvP/Scroll/enabled/next2# ";

importPackage(net.sf.cherry.client);
var status = 0;
var zones = 0;
//4000425
var ItemId = Array(
//物品1         物品2    货币    50
Array(1052142,4000463, 150, "背带短裤套装"),
Array(1052599,4000463, 150, "奥兹魔法长袍"),
Array(1052598,4000463, 150, "胡克的船长长袍"),
Array(1052576,4000463, 150, "斯乌黑色之翼制服"),
Array(1052290,4000463, 150, "唤灵斗师套装"),
Array(1052675,4000463, 150, "万圣节幻影帽子套服"),
Array(1052605,4000463, 150, "舒适绵羊睡衣"),
Array(1052749,4000463, 150, "未来天使服"),
Array(1052750,4000463, 150, "未来医生套服"),
Array(1052550,4000463, 150, "时间旅行者的礼服"),
Array(1052643,4000463, 150, "血腥珍妮"),
Array(1052655,4000463, 150, "熊宝宝全身装"),
Array(1052253,4000463, 150, "青草背带裤套装"), 
Array(1052549,4000463, 150, "红勇士马甲"), 
Array(1052757,4000463, 150, "爱丽丝礼服"), 
Array(1050113,4000463, 150, "燕尾服(男)"), 
Array(1052234,4000463, 150, "绅士套服"), 
Array(1052439,4000463, 150, "魔法学校校服"), 
Array(1052536,4000463, 150, "水手装"), 
Array(1052568,4000463, 150, "华丽圣诞套服"), 
Array(1052601,4000463, 150, "废都高校校服"), 
Array(1052628,4000463, 150, "蓝色制服"), 
Array(1052629,4000463, 150, "银色制服"), 
Array(1052630,4000463, 150, "黑色制服"), 
Array(1052438,4000463, 150, "麻薯巧克力衣服"), 
Array(1052539,4000463, 150, "蓝道服"), 
Array(1052538,4000463, 150, "鬼怪服"),
Array(1052449,4000463, 150, "时尚香肠套服"), Array(1052455,4000463, 150, "小蜜蜂外套"), Array(1052668,4000463, 150, "海豹白白服"), Array(1052594,4000463, 150, "小恐龙绿豆套服"), Array(1052595,4000463, 150, "小恐龙云豆套服"), Array(1052661,4000463, 150, "咯咯哒娃娃装"), Array(1052602,4000463, 150, "黑色管家礼服"), Array(1052726,4000463, 150, "僵尸新娘全身装"), Array(1052724,4000463, 150, "小马乖乖套服"), Array(1052661,4000463, 150, "小鸡玩偶服 "), Array(1052660,4000463, 150, "蓬松背带裤"), Array(1052571,4000463, 150, "黑暗小恶魔全身装"), Array(1052275,4000463, 150, "皇家彩虹夹克"), Array(1052626,4000463, 150, "海洋风条纹装"), Array(1052604,4000463, 150, "苍恋玫瑰礼服"), Array(1052458,4000463, 150, "露西亚全身装"), Array(1050227,4000463, 150, "薄荷雪套服"), Array(1052245,4000463, 150, "小嫩叶套服"), Array(1050170,4000463, 150, "拿破仑制服-男"), Array(1052193,4000463, 150, "蜜蜂服"), Array(1050232,4000463, 150, "甘菊下午茶"), Array(1050234,4000463, 150, "魔术师晚礼服"), Array(1050242,4000463, 150, "开场男星"), Array(1052423,4000463, 150, "魔族高贵外套"), Array(1052448,4000463, 150, "西红柿外套"), Array(1052503,4000463, 150, "冰爽夏日全身装"), Array(1052203,4000463, 150, "购物狂休闲装"), Array(1052231,4000463, 150, "小王子礼服"), Array(1042242,4000463, 150, "夏季野餐"), Array(1042172,4000463, 150, "高尔夫上衣"), Array(1042194,4000463, 150, "经典款T恤 "), Array(1042314,4000463, 150, "兔兔熊T恤"), Array(1042170,4000463, 150, "酷夏T恤"), Array(1042329,4000463, 150, "糖果色T恤"), Array(1042320,4000463, 150, "海鸥印花T恤"), Array(1042102,4000463, 150, "海军T恤"), Array(1042221,4000463, 150, "白色篮球T恤"), Array(1042103,4000463, 150, "白色随意T恤"), Array(1042130,4000463, 150, "长金链短T"), Array(1042138,4000463, 150, "银链街头背心"), Array(1042134,4000463, 150, "黄色半袖T恤"), Array(1042133,4000463, 150, "蓝条纹两件套"), Array(1042140,4000463, 150, "探险家衬衫"), Array(1042141,4000463, 150, "粉星短袖T恤"), Array(1042146,4000463, 150, "星星连帽衫"), Array(1042144,4000463, 150, "蓝格子短袖衬衫"), Array(1042153,4000463, 150, "红呢绒格子外套"), Array(1042162,4000463, 150, "蓝条纹棉背心"), Array(1042164,4000463, 150, "绿领带衬衫"), Array(1042177,4000463, 150, "修身小外套"), Array(1042207,4000463, 150, "星纹运动服"), Array(1042220,4000463, 150, "亮片表演上装"), Array(1042263,4000463, 150, "明星熊仔夹克"), Array(1042279,4000463, 150, "训字T恤"), Array(1042280,4000463, 150, "民字T恤"), Array(1042281,4000463, 150, "正字T恤"), Array(1042282,4000463, 150, "音字T恤"), Array(1042287,4000463, 150, "红格骑士服"), Array(1042290,4000463, 150, "白色背带编织服"), Array(1042292,4000463, 150, "香蕉羊毛衫"), Array(1042293,4000463, 150, "林之灵上衣"), Array(1042242,4000463, 150, "无袖水手上衣"), Array(1042265,4000463, 150, "草莓围脖小上衣"), Array(1042275,4000463, 150, "青蛙雨衣"), Array(1042241,4000463, 150, "飞翔紫罗兰"), Array(1042199,4000463, 150, "粉色笑脸T恤"), Array(1042200,4000463, 150, "蓝色笑脸T恤"), Array(1042202,4000463, 150, "小企企卷边T恤"), Array(1042107,4000463, 150, "紫印花T恤"), Array(1042204,4000463, 150, "汉堡T恤"), Array(1042193,4000463, 150, "休闲风两件套"), Array(1042198,4000463, 150, "彩虹T恤"), Array(1042214,4000463, 150, "粉条文两件套"), Array(1042219,4000463, 150, "蓝莓糖果套头衫"), Array(1042218,4000463, 150, "木莓糖果套头衫"), Array(1042222,4000463, 150, "柠檬色可爱T恤"), Array(1042187,4000463, 150, "粉红绒绒衫"), Array(1042189,4000463, 150, "羊羊上衣"), Array(1040186,4000463, 150, "牛仔衬衫"), Array(1042230,4000463, 150, "防水外套"), Array(1042235,4000463, 150, "爱丽丝兔子上衣"), Array(1042236,4000463, 150, "苹果绿毛上衣"), Array(1042237,4000463, 150, "黑白潮人马甲"), Array(1042238,4000463, 150, "粉红兔毛衣"), Array(1042108,4000463, 150, "水印闪星背心"), Array(1042096,4000463, 150, "超人T恤"), Array(1042097,4000463, 150, "印花休闲套头T恤"), Array(1042104,4000463, 150, "小绿叶T恤"), Array(1042105,4000463, 150, "小红叶T恤"), Array(1042142,4000463, 150, "彩虹条背心"), Array(1040144,4000463, 150, "巨星摩登上装（男）"), Array(1062137,4000463, 150, "POP短裤（紫）"), Array(1062138,4000463, 150, "POP短裤（蓝）"), Array(1062135,4000463, 150, "精英裤子"), Array(1062151,4000463, 150, "爱丽丝兔子裤"), Array(1062085,4000463, 150, "修身小西裤"), Array(1062084,4000463, 150, "细身牛仔裤"), Array(1062153,4000463, 150, "假日斜纹短裤"), Array(1062130,4000463, 150, "点点蓝休闲裤  "), Array(1062129,4000463, 150, "点点红休闲裤 "), Array(1062054,4000463, 150, "南瓜裤"), Array(1062053,4000463, 150, "粉边白短裤"), Array(1062066,4000463, 150, "白色破颇牛仔裤"), Array(1062110,4000463, 150, "baby粉色灯笼裤"), Array(1062111,4000463, 150, "蓝色蝴蝶结短裤"), Array(1062113,4000463, 150, "彩铅短裤"), Array(1062114,4000463, 150, "心心相映短裤"), Array(1062152,4000463, 150, "荧光粉色短裤"), Array(1062154,4000463, 150, "分层斜纹短裤"), Array(1062156,4000463, 150, "紫色马赛克短裤"), Array(1062157,4000463, 150, "草莓巧克力短裤"),
Array(1702105,4000463, 150, "通心钥匙"), 
Array(1702051,4000463, 150, "灯笼"), Array(1702104,4000463, 150, "巨无霸冰淇淋"), Array(1702374,4000463, 150, "剑豪之刃"), Array(1702212,4000463, 150, "异界之器"), Array(1702091,4000463, 150, "网球拍"), Array(1702115,4000463, 150, "玫瑰花"), Array(1702217,4000463, 150, "黄鸭子游泳圈"), Array(1702228,4000463, 150, "可可香蕉"), Array(1702230,4000463, 150, "冰蓝雪糕"), Array(1702237,4000463, 150, "千年白狐"), Array(1702256,4000463, 150, "风灵使者娃娃"), Array(1702257,4000463, 150, "魂骑士娃娃"), Array(1702258,4000463, 150, "炎术士娃娃"), Array(1702259,4000463, 150, "奇袭者娃娃"), Array(1702260,4000463, 150, "夜行者娃娃"), Array(1702261,4000463, 150, "樱花棒"), Array(1702194,4000463, 150, "圣火火炬"), Array(1702288,4000463, 150, "豹弩游侠弩"), Array(1702318,4000463, 150, "暮光雷光剑"), Array(1702319,4000463, 150, "苹果绿雷光剑"), Array(1702317,4000463, 150, "血红宝石雷光剑"), Array(1702320,4000463, 150, "蓝灰闪电雷光剑"), Array(1702321,4000463, 150, "黑暗中子星雷光剑"), Array(1702322,4000463, 150, "固态黑色雷光剑"), Array(1702323,4000463, 150, "翁布拉&鲁切雷光剑"), Array(1702186,4000463, 150, "迪波"), Array(1702209,4000463, 150, "驯鹿拐杖"), Array(1702204,4000463, 150, "日本铁扇"), Array(1702203,4000463, 150, "万圣节泰迪熊"), Array(1702150,4000463, 150, "冰凌刀"), Array(1702149,4000463, 150, "熔岩刀"), Array(1702157,4000463, 150, "火烤棉花糖"), Array(1702161,4000463, 150, "凶恶的狗狗"), Array(1702136,4000463, 150, "雪之花"), Array(1702120,4000463, 150, "比耶莫特的剑"), Array(1702118,4000463, 150, "亚努斯的剑"), Array(1702119,4000463, 150, "夏奇尔的剑"), Array(1702296,4000463, 150, "溜溜球"), Array(1702285,4000463, 150, "蓝色蝴蝶结手提包"), Array(1702302,4000463, 150, "杯具"), Array(1702208,4000463, 150, "搞怪鳄鱼"), Array(1702305,4000463, 150, "胡萝卜武器"), Array(1702310,4000463, 150, "星光魔法棒"), Array(1702374,4000463, 150, "剑豪之刃"), Array(1702306,4000463, 150, "花风芭蕉扇"), Array(1702379,4000463, 150, "阿拉伯魔术洋灯"), Array(1702378,4000463, 150, "国庆闪亮之光"), Array(1702263,4000463, 150, "小灰灰猫"), Array(1702308,4000463, 150, "魔术师帽子"), Array(1702298,4000463, 150, "暗影刀子"), Array(1702291,4000463, 150, "玲珑扇"), Array(1702293,4000463, 150, "秋天旅行者背包"), Array(1702299,4000463, 150, "可爱巧克力棒"), Array(1702300,4000463, 150, "电蚊拍"), Array(1702328,4000463, 150, "粉红天使注射器"), Array(1702329,4000463, 150, "喜欢草莓"), Array(1702233,4000463, 150, "彩虹毛笔"), Array(1702187,4000463, 150, "蓝色极光"), Array(1702188,4000463, 150, "粉色极光"), Array(1702193,4000463, 150, "湿抹布"), Array(1702248,4000463, 150, "圣诞武器"), Array(1702252,4000463, 150, "鹰的飞舞"), Array(1702276,4000463, 150, "天际之弓"), Array(1702283,4000463, 150, "天界圣战手镯"), Array(1702279,4000463, 150, "天界圣战之剑"), Array(1702280,4000463, 150, "天界圣战巨剑"), Array(1702281,4000463, 150, "天界圣战法杖"), Array(1702282,4000463, 150, "天界圣战藏弓"), Array(1702362,4000463, 150, "我的好友品克缤"), Array(1702324,4000463, 150, "冲击波"), Array(1702323,4000463, 150, "鲁切雷光剑"), Array(1702313,4000463, 150, "橙色极光"), Array(1702314,4000463, 150, "天堂极光"), Array(1702315,4000463, 150, "斯泰拉极光"), Array(1702316,4000463, 150, "动态极光"), Array(1702295,4000463, 150, "扑克牌"), Array(1702348,4000463, 150, "雪片"), Array(1702274,4000463, 150, "神龙手套"), Array(1702301,4000463, 150, "兔兔魔力棒"),
Array(1102665,4000463, 150, "狐狸围脖"), 
Array(1102625,4000463, 150, "红色蜗牛壳"), Array(1102651,4000463, 150, "小浣熊尾巴"), Array(1102652,4000463, 150, "松鼠尾巴"), Array(1102654,4000463, 150, "狗狗尾巴"), Array(1102655,4000463, 150, "熊熊尾巴"), Array(1102188,4000463, 150, "银色狐狸尾巴"), Array(1102187,4000463, 150, "金色狐狸尾巴"), Array(1102648,4000463, 150, "K君的猫尾巴"), Array(1102387,4000463, 150, "海龙尾巴"), Array(1102388,4000463, 150, "炎龙尾巴"), Array(1102292,4000463, 150, "尾巴"), Array(1102296,4000463, 150, "夜叉尾巴（黑色）"), Array(1102656,4000463, 150, "动物尾巴6"), Array(1102622,4000463, 150, "时间旅行者的怀表"), Array(1102692,4000463, 150, "寿司团"), Array(1102574,4000463, 150, "小鸡叽叽叽"), Array(1102380,4000463, 150, "我的朋友青蛙酱"), Array(1102549,4000463, 150, "管家的猫咪"), Array(1102705,4000463, 150, "企鹅书包"), Array(1102683,4000463, 150, "兔兔熊背包"), Array(1102684,4000463, 150, "未来医生听诊器"), Array(1102682,4000463, 150, "未来天使注射器"), Array(1102593,4000463, 150, "浮漾的翅膀"), Array(1102668,4000463, 150, "夜天使之翼"), Array(1102353,4000463, 150, "自由的翅膀"), Array(1102554,4000463, 150, "女妖之翼"), Array(1102391,4000463, 150, "小蜜蜂翅膀"), Array(1102325,4000463, 150, "紫天使羽翼"), Array(1102326,4000463, 150, "蓝天使羽翼"), Array(1102389,4000463, 150, "金色天使"), Array(1102390,4000463, 150, "银色天使"), Array(1102273,4000463, 150, "路西法之翼"), Array(1102349,4000463, 150, "发光精灵翅膀"), Array(1102293,4000463, 150, "羁绊之翼"), Array(1102152,4000463, 150, "黑骷髅海盗旗"), Array(1102300,4000463, 150, "派对舞会灯"), Array(1102288,4000463, 150, "背背雪人"), Array(1102274,4000463, 150, "刺柏刀"), Array(1102310,4000463, 150, "精灵披风"), Array(1102461,4000463, 150, "粉嫩披风"), Array(1102222,4000463, 150, "死神披风"), Array(1102583,4000463, 150, "宝贝龙波比"), Array(1102232,4000463, 150, "小王子的星星"), Array(1102218,4000463, 150, "仙女飘飘"), Array(1102356,4000463, 150, "天使祖母绿"), Array(1102270,4000463, 150, "风和日丽"), Array(1102261,4000463, 150, "音符围脖"), Array(1102251,4000463, 150, "世界杯手巾"), Array(1102373,4000463, 150, "露西娅披风"), Array(1102301,4000463, 150, "旅行者披风"), Array(1102255,4000463, 150, "唤灵斗师披风"), Array(1102254,4000463, 150, "豹弩游侠披风"), Array(1102242,4000463, 150, "胡克的船长披风"), Array(1102249,4000463, 150, "奥兹魔法披风"), Array(1102239,4000463, 150, "暗影双刀披风"), Array(1102355,4000463, 150, "怪盗幻影披风"), Array(1102673,4000463, 150, "僵尸新娘披风"), Array(1102324,4000463, 150, "传说双层气球"), Array(1102212,4000463, 150, "丢失的小孩"), Array(1102233,4000463, 150, "雪娃娃披风"), Array(1102230,4000463, 150, "企企雪橇披风"), Array(1102245,4000463, 150, "太阳披风"), Array(1102258,4000463, 150, "玩具熊气球"), Array(1102215,4000463, 150, "气球串"), Array(1102271,4000463, 150, "可爱巧克力棒气球"), Array(1102488,4000463, 150, "蛋糕杯气球"), Array(1102285,4000463, 150, "晴天娃娃(粉色)"), Array(1102286,4000463, 150, "晴天娃娃(天蓝色)"), Array(1102287,4000463, 150, "晴天娃娃(淡黄色)"), Array(1002960,4000463, 150, "暗夜娃娃皇冠"), 
Array(1002756,4000463, 150, "英雄之冠"), Array(1003084,4000463, 150, "帝国皇冠"), Array(1003861,4000463, 150, "明星小皇冠"), Array(1003216,4000463, 150, "贵族船长帽"), Array(1003398,4000463, 150, "黑暗米哈尔"), Array(1003399,4000463, 150, "黑暗奥兹"), Array(1003400,4000463, 150, "黑暗伊莉娜"), Array(1003401,4000463, 150, "黑暗伊卡尔特"), Array(1003402,4000463, 150, "黑暗胡克"), Array(1003458,4000463, 150, "茅山道士帽"), Array(1003846,4000463, 150, "丹珍帽子"), Array(1003104,4000463, 150, "巨型蛋糕帽"), Array(1003246,4000463, 150, "可爱兔子帽"), Array(1004112,4000463, 150, "刀马旦花帽"), Array(1003776,4000463, 150, "海豹白白帽"), Array(1003392,4000463, 150, "小蜜蜂帽子"), Array(1003802,4000463, 150, "小恐龙绿豆帽子"), Array(1003803,4000463, 150, "小恐龙云豆帽子"), Array(1003728,4000463, 150, "蓝色精灵帽"), Array(1003727,4000463, 150, "红色精灵帽"), Array(1003509,4000463, 150, "时尚香肠帽"), Array(1003508,4000463, 150, "西红柿帽子"), Array(1004189,4000463, 150, "企鹅王帽子"), Array(1004124,4000463, 150, "恋爱小草莓帽"), Array(1004125,4000463, 150, "歌唱大菠萝帽"), Array(1003829,4000463, 150, "兔耳管家礼帽"), Array(1003541,4000463, 150, "逆转兔帽子"), Array(1004126,4000463, 150, "彩塘熊耳帽"), Array(1004092,4000463, 150, "小马乖乖帽"), Array(1003842,4000463, 150, "女妖帽子"), Array(1003463,4000463, 150, "精灵妈妈帽"), Array(1003921,4000463, 150, "咕噜噜鸭舌帽"), Array(1003588,4000463, 150, "玩具粉熊帽子"), Array(1003909,4000463, 150, "活力苏打帽"), Array(1003596,4000463, 150, "金属粉色棒球帽"), Array(1003597,4000463, 150, "金属冠棒球帽"), Array(1003462,4000463, 150, "Kitty猫猫帽"), Array(1003268,4000463, 150, "按键狂人糖果帽"), Array(1003269,4000463, 150, "按键狂人玩具帽"), Array(1003241,4000463, 150, "摇滚歌手帽"), Array(1003533,4000463, 150, "黑暗奥尔卡军官帽"), Array(1002524,4000463, 150, "可乐帽"), Array(1003790,4000463, 150, "高尔夫遮阳帽"), Array(1004137,4000463, 150, "兔兔熊帽"), Array(1003919,4000463, 150, "花花绒线帽"), Array(1003077,4000463, 150, "花别针尼龙帽"), Array(1003215,4000463, 150, "粉色雪花帽"), Array(1003387,4000463, 150, "耳机毛线帽"), Array(1003210,4000463, 150, "绒球遮耳帽"), Array(1002422,4000463, 150, "点点星光帽"), Array(1003920,4000463, 150, "夏威夷草帽"), Array(1003519,4000463, 150, "霞光草帽"), Array(1003141,4000463, 150, "稻草编织帽"), Array(1003531,4000463, 150, "西式风情帽"), Array(1003539,4000463, 150, "蓝色天使帽"), Array(1004136,4000463, 150, "未来天使帽"), Array(1003793,4000463, 150, "杜鹃花发簪"), Array(1003958,4000463, 150, "香草糯米冰"), Array(1003957,4000463, 150, "薄荷糯米冰"), Array(1004191,4000463, 150, "粉红翅膀帽"), Array(1004203,4000463, 150, "喵星人的秘密"), Array(1004014,4000463, 150, "阿宅守护精灵"), Array(1003967,4000463, 150, "巧可羊帽子"), Array(1004204,4000463, 150, "小蓝马"), Array(1004205,4000463, 150, "小红马"), Array(1003234,4000463, 150, "粉色卓别林帽子"), Array(1003235,4000463, 150, "珠宝蓝卓别林帽子"), Array(1002920,4000463, 150, "粉红淑女帽"), Array(1001042,4000463, 150, "紫环头纱"), Array(1004113,4000463, 150, "僵尸新娘的面纱"), 
Array(1004123,4000463, 150, "时尚小圆帽"), Array(1002885,4000463, 150, "新型蝴蝶结"), Array(1003133,4000463, 150, "雪姬蝴蝶结"), Array(1003233,4000463, 150, "最爱兔子发夹"), Array(1003222,4000463, 150, "冰蓝蝴蝶卡子"), Array(1003362,4000463, 150, "玫瑰粉双蝴蝶结"), Array(1003862,4000463, 150, "熊宝宝发带"), Array(1003132,4000463, 150, "红色精致丝带"), Array(1004111,4000463, 150, "粉色波点发箍"), Array(1004110,4000463, 150, "蓝色波点发箍"), Array(1003071,4000463, 150, "淘气女孩粉色发箍"), Array(1003072,4000463, 150, "黑蕾丝蝴蝶发箍"), Array(1003459,4000463, 150, "露西娅帽子"), Array(1003750,4000463, 150, "绸带猫耳"), Array(1003760,4000463, 150, "猫咪耳机"), Array(1003505,4000463, 150, "炎龙角"), Array(1003278,4000463, 150, "孔雀羽毛"), Array(1003503,4000463, 150, "爱丽丝的茶杯"), Array(1003223,4000463, 150, "寻找妈咪的小鸡"), Array(1003510,4000463, 150, "爱丽丝兔子头饰"), Array(1003202,4000463, 150, "黄金甲壳虫"), Array(1003367,4000463, 150, "彩色花环"), Array(1003376,4000463, 150, "天使的发夹"), Array(1003742,4000463, 150, "黑暗小恶魔帽子"), Array(1003761,4000463, 150, "圣洁天使帽"), Array(1003461,4000463, 150, "秀秀"), Array(1003277,4000463, 150, "草业妖精帽"), Array(1000051,4000463, 150, "精灵精神发带"), Array(1003520,4000463, 150, "可爱丝线发带"), Array(1003860,4000463, 150, "赛利亚假发"), Array(1003807,4000463, 150, "桃心太阳眼镜"), Array(1003264,4000463, 150, "太阳镜"), Array(1003265,4000463, 150, "水手太阳镜"), Array(1003594,4000463, 150, "凉爽夏日潜水镜"), Array(1003043,4000463, 150, "叮当鹿角"), Array(1003078,4000463, 150, "灵异蝴蝶"), Array(1003581,4000463, 150, "蝴蝶伴舞头饰"), Array(1003586,4000463, 150, "薄荷海军帽"), Array(1003587,4000463, 150, "粉红丝带海军帽"), Array(1003079,4000463, 150, "小嫩叶帽"), Array(1003083,4000463, 150, "小嫩苗"), Array(1002888,4000463, 150, "丝带发箍（红色）"), Array(1002890,4000463, 150, "丝带发箍（蓝色）"), Array(1003639,4000463, 150, "荧光发箍-粉色"), Array(1003640,4000463, 150, "荧光发箍-蓝色"), Array(1003641,4000463, 150, "荧光发箍-绿色"), Array(1003642,4000463, 150, "荧光发箍-金色"), Array(1003249,4000463, 150, "8周年音符黄晶"), Array(1003250,4000463, 150, "8周年音符红宝石"), Array(1003251,4000463, 150, "8周年音符黄水晶"), Array(1003252,4000463, 150, "8周年音符紫水晶"), Array(1003548,4000463, 150, "魔术师黑色礼帽"), Array(1003549,4000463, 150, "魔术师黑色缎带"), Array(1003607,4000463, 150, "蓝宝石羽毛发饰"), Array(1003636,4000463, 150, "水神帽"), Array(1003865,4000463, 150, "星光飘带帽子"), Array(1003516,4000463, 150, "爱丽丝兔子头饰"), Array(1003461,4000463, 150, "玫瑰秀秀"), Array(1000053,4000463, 150, "贵族晚宴帽(男)"), Array(1000050,4000463, 150, "薄荷雪水晶(男)"), Array(1000045,4000463, 150, "军团长假发-男"), Array(1000046,4000463, 150, "精灵王假发-男"), Array(1000071,4000463, 150, "蓝色蝴蝶结礼帽（男）"), Array(1002444,4000463, 150, "蜀皇之冠"), Array(1002445,4000463, 150, "魏皇之冠"), Array(1002446,4000463, 150, "吴皇之冠"), Array(1003460,4000463, 150, "奶油巧克力帽子"), Array(1003796,4000463, 150, "甜蜜冰淇淋帽"), Array(1003542,4000463, 150, "草莓杏仁饼发卡"), 
Array(1003543,4000463, 150, "杏仁饼发卡"), Array(1003544,4000463, 150, "草莓纸杯蛋糕发卡"), Array(1003545,4000463, 150, "哈密瓜纸杯蛋糕发卡"), Array(1003546,4000463, 150, "巧克力纸杯蛋糕发卡"), Array(1003547,4000463, 150, "冰激淋纸杯蛋糕发卡"), Array(1003484,4000463, 150, "逗逗龙帽-白色"), Array(1003482,4000463, 150, "逗逗龙帽-绿色"), Array(1003483,4000463, 150, "逗逗龙帽-粉色"), Array(1003487,4000463, 150, "龙龙贪吃帽-白色"), Array(1003486,4000463, 150, "龙龙贪吃帽-金色"), Array(1003485,4000463, 150, "龙龙贪吃帽-绿色"), Array(1003492,4000463, 150, "蓬松蛋卷寿司"), Array(1003493,4000463, 150, "新鲜三文鱼"), Array(1003494,4000463, 150, "Q弹章鱼寿司"), Array(1003495,4000463, 150, "鲑鱼子寿司"), Array(1003496,4000463, 150, "呀吼鲜虾寿司"), Array(1003595,4000463, 150, "卷发兔子"), Array(1022184,4000463, 150, "烈焰之瞳(蓝)"), Array(1022183,4000463, 150, "烈焰之瞳(红) "), Array(1012450,4000463, 150, "巧克力彩豆曲奇"), Array(1012412,4000463, 150, "血泪 "), Array(1012099,4000463, 150, "蓝色腮红 "), Array(1012253,4000463, 150, "心跳唇彩"), Array(1012160,4000463, 150, "烈焰红唇"), Array(1012208,4000463, 150, "害羞了 "), Array(1012131,4000463, 150, "好白的牙"), Array(1012165,4000463, 150, "小丑鼻子"), Array(1012176,4000463, 150, "娃娃脸"), Array(1012179,4000463, 150, "鹿鼻子"), Array(1012135,4000463, 150, "吐舌头"), Array(1022059,4000463, 150, "经典黑色墨镜"), Array(1022057,4000463, 150, "POP眼镜"), Array(1022064,4000463, 150, "时尚大太阳镜"), Array(1022063,4000463, 150, "无框小圆眼镜"), Array(1022104,4000463, 150, "3D炫彩眼镜"), Array(1022102,4000463, 150, "LED炫光眼镜"), Array(1022108,4000463, 150, "柠檬黄潮流眼镜"), Array(1022109,4000463, 150, "玫瑰红潮流眼镜"), Array(1003265,4000463, 150, "爱心天蓝墨镜"), Array(1022110,4000463, 150, "非主流墨镜"), Array(1022122,4000463, 150, "DJ眼镜"), Array(1032029,4000463, 150, "925银耳环"), Array(1032181,4000463, 150, "杜鹃花耳环"), Array(1032034,4000463, 150, "可乐耳环"), Array(1032094,4000463, 150, "胡萝卜耳环"), Array(1032088,4000463, 150, "体力猎犬耳环"), Array(1032145,4000463, 150, "螃蟹耳环"), Array(5010082,4000463, 150, "新星效果"), Array(4290004,4000463, 150, "2010庚延年纪念品"), Array(4290003,4000463, 150, "幻想妖精"), Array(4290001,4000463, 150, "倒霉效果 "), Array(4290000,4000463, 150, "金鸡效果"), Array(5010080,4000463, 150, "（效果）下雨"), Array(5160017,4000463, 150, "哼哼"), Array(5160015,4000463, 150, "晕乎乎"), Array(5010015,4000463, 150, "777效果"), Array(5010008,4000463, 150, "幸运儿效果"), Array(5021011,4000463, 150, "骷髅飞镖"), Array(5021012,4000463, 150, "南瓜派"), Array(5021013,4000463, 150, "海盗炸弹"), Array(5021026,4000463, 150, "开心的圣诞老人"), Array(1003843,4000463, 150, "奇怪的狐狸面具"), Array(1113021,4000463, 150, "爱情加速器"), Array(1003755,4000463, 150, "无限白雪"), Array(1102604,4000463, 150, "蒼穹之翼"), Array(1003393,4000463, 150, "帝国伯爵冠"), Array(1102381,4000463, 150, "皇家公爵翅膀"), Array(1032234,4000463, 150, "蓝色桃心耳环"), Array(1032233,4000463, 150, "粉色桃心耳环"), Array(1002839,4000463, 150, "南瓜棒球帽"), Array(1112928,4000463, 150, "粉色流星戒指90天"), Array(1112924,4000463, 150, "黄色流星戒指90天"), Array(1112930,4000463, 150, "西红柿效果-90天"), Array(1112937,4000463, 150, "催眠曲戒指(90天)"), Array(1112916,4000463, 150, "寂寞单身戒指"),
Array(5010069,4000463, 150, "死神之翼"), Array(1042271,4000463, 150, "外星人拼色T恤"), Array(1042321,4000463, 150, "心花怒放T恤"), Array(1042260,4000463, 150, "点点星光羊毛上衣"), Array(1050284,4000463, 150, "派对公子服(男)"), Array(1050302,4000463, 150, "执事之品格(男)"), Array(1000052,4000463, 150, "公主冠（男）"), Array(1052731,4000463, 150, "黑色可爱游泳服"), Array(1052634,4000463, 150, "简洁白衬衫"), Array(1052209,4000463, 150, "皇家海军制服"), Array(1050152,4000463, 150, "水兵服男"), Array(1052201,4000463, 150, "闪亮水手外套"), 
Array(1004108,4000463, 150, "幻夜蝶华礼帽"), Array(1003247,4000463, 150, "杂技团老板帽"), Array(1003272,4000463, 150, "格莱特帽"), Array(1003276,4000463, 150, "蓝心透明帽子"), Array(1003271,4000463, 150, "红心透明帽子"), Array(1003918,4000463, 150, "翅膀帽"), Array(1004029,4000463, 150, "小白熊便帽"), Array(1004026,4000463, 150, "小黑猫便帽"), Array(1004028,4000463, 150, "小花猫便帽"), Array(1004027,4000463, 150, "白猫无边帽 "), Array(1003955,4000463, 150, "浪漫玫瑰"), Array(1004094,4000463, 150, "白巧克力兔子发箍"), Array(1004193,4000463, 150, "护目镜帽子"), Array(1003892,4000463, 150, "树叶钻石"), Array(1002846,4000463, 150, "蓝天贝雷帽"), Array(1002995,4000463, 150, "皇家海军帽"), Array(1003748,4000463, 150, "皇家天使帽"), Array(1702168,4000463, 150, "闪亮圣诞树"), Array(1702278,4000463, 150, "枫之武器"), 
Array(1702211,4000463, 150, "亮丽雪片"), Array(1702289,4000463, 150, "皇家海军旗帜"), Array(1702287,4000463, 150, "唤灵斗师长杖"), Array(1702277,4000463, 150, "密码签字笔"), Array(1702309,4000463, 150, "多味棒棒糖"), Array(1702155,4000463, 150, "绚丽彩虹"), Array(1102605,4000463, 150, "暗炎赎罪者"), Array(1102671,4000463, 150, "肃清者的荆翼"), Array(1102564,4000463, 150, "天衣无缝"), Array(1102653,4000463, 150, "兔尾巴"), Array(1102267,4000463, 150, "我的朋友九尾狐尾巴"), Array(1051311,4000463, 150, "黑暗力量连身衣(女)"), Array(1051199,4000463, 150, "樱花服"), Array(1051173,4000463, 150, "条纹淑女连衣裙"), Array(1051118,4000463, 150, "粉红可爱游泳服"), Array(1051189,4000463, 150, "怦然心动装"), Array(1051233,4000463, 150, "车模装"), Array(1052410,4000463, 150, "粉嫩花仙裙"), Array(1051350,4000463, 150, "派对名媛裙"), Array(1051376,4000463, 150, "万圣节机器人裙"), Array(1051375,4000463, 150, "欧迪尔芭蕾裙"), Array(1051349,4000463, 150, "女妖"), Array(1051387,4000463, 150, "春游连衣裙"), Array(1051296,4000463, 150, "玩世不恭裙装"), Array(1051295,4000463, 150, "魔法裙装"), Array(1051294,4000463, 150, "抒情裙装 "), Array(1051192,4000463, 150, "海洋裹裹短裙  "), Array(1051160,4000463, 150, "裹裹短裙"), Array(1052593,4000463, 150, "粉红缎带冰淇淋服"), Array(1051303,4000463, 150, "抹胸礼裙"), Array(1051261,4000463, 150, "童话幻想"), Array(1052419,4000463, 150, "粉娃娃群"), Array(1051180,4000463, 150, "水兵服女"), Array(1051363,4000463, 150, "开场天使"), Array(1051278,4000463, 150, "樱桃雪套服"), Array(1051219,4000463, 150, "彩虹mini连衣裙"), Array(1051211,4000463, 150, "伊丽莎白礼服"), Array(1051221,4000463, 150, "圣诞节套服-女"), Array(1051228,4000463, 150, "粉红色雪花休闲装"), Array(1051229,4000463, 150, "花少女韩服"), Array(1051231,4000463, 150, "阿尔卑斯山少女装"), Array(1051232,4000463, 150, "闪烁之星女孩礼服"), Array(1052656,4000463, 150, "白天鹅芭蕾服"), Array(1051235,4000463, 150, "橙色小鸡裙子"), Array(1051252,4000463, 150, "粉红天使制服"), Array(1051253,4000463, 150, "红帽迷你裙"), Array(1051254,4000463, 150, "萝莉学生装"), Array(1052295,4000463, 150, "粉红色女仆装"), Array(1052296,4000463, 150, "天蓝色女仆装"), Array(1052298,4000463, 150, "兔耳洛莉塔套服"), Array(1052225,4000463, 150, "暗夜娃娃服"), Array(1052306,4000463, 150, "雪姬和服"), Array(1041142,4000463, 150, "巨星蛋糕吊带"), Array(1041127,4000463, 150, "爱心背心"), Array(1041189,4000463, 150, "女牛仔衬衫"), Array(1001076,4000463, 150, "樱桃雪水晶"), Array(1001064,4000463, 150, "闪耀Girl帽子"), Array(1001083,4000463, 150, "爆莉萌天使发卡"), Array(1001044,4000463, 150, "绿色婚纱头纱"), Array(1001061,4000463, 150, "伊丽莎白假发(女)"), Array(1001068,4000463, 150, "军团长假发-女"), Array(1001069,4000463, 150, "精灵王假发-女"), Array(1001094,4000463, 150, "蓝色蕾丝头巾"), Array(1001089,4000463, 150, "兔子胡萝卜绒线帽"), Array(1001085,4000463, 150, "粉蝴蝶发卡"), Array(1061148,4000463, 150, "巨星粉色短裙"), Array(1061001,4000463, 150, "蓝超短裙"), Array(1061007,4000463, 150, "红超短裙 "), Array(1061126,4000463, 150, "白色超短裙"), Array(1061067,4000463, 150, "热裤"), Array(1081007,4000463, 150, "伊丽莎白手套"), Array(1051200,4000463, 150, "邦妮女孩套服"), Array(1050161,4000463, 150, "邦妮男孩套服"), Array(1050177,4000463, 150, "MapleBoy套服"), Array(1051218,4000463, 150, "MapleGirl套服"), Array(1052727,4000463, 150, "快乐连体衫"), Array(1052728,4000463, 150, "快乐连衣裙"), Array(1051357,4000463, 150, "可爱棒球服（女）"), Array(1050291,4000463, 150, "可爱棒球服（男）"), Array(1000072,4000463, 150, "蓝色钱包君（男）"), Array(1001095,4000463, 150, "粉色钱包君（女）"), Array(1050299,4000463, 150, "小娃娃普卡（男）"), Array(1051366,4000463, 150, "小娃娃皮卡（女）"), Array(1050293,4000463, 150, "海滩帅锅装（男）"), Array(1051359,4000463, 150, "海滩美眉装"), Array(1050293,4000463, 150, "海滩帅锅装"), Array(1050210,4000463, 150, "蓝色小背带服"), Array(1051256,4000463, 150, "蓝色小背带裙"), Array(1050209,4000463, 150, "黄色晚礼服-男款"), 
Array(1051255,4000463, 150, "黄色晚礼服-女款"), 
Array(1042213,4000463, 150, "粉色雪花卫衣"), 
Array(1042212,4000463, 150, "蓝色点点外套"), 
Array(1042216,4000463, 150, "红色枫叶网球服"), 
Array(1042217,4000463, 150, "黑色枫叶网球服"), 
Array(1048001,4000463, 150, "兔兔情侣衫  "), 
Array(1048002,4000463, 150, "胡萝卜情侣衫 "), 
Array(1042313,4000463, 150, "魔蘑菇T恤（柠檬黄）"), 
Array(1042312,4000463, 150, "魔蘑菇T恤（冰雪蓝）"), 
Array(1042316,4000463, 150, "粉色萌萌象"), 
Array(1042315,4000463, 150, "蓝色萌萌象"), 
Array(1050190,4000463, 150, "闪烁之星男生礼服"), 
Array(1051232,4000463, 150, "闪烁之星女孩礼服"), 
Array(1050310,4000463, 150, "天生购物狂（男）"), 
Array(1051382,4000463, 150, "天生购物狂（女）"), 
Array(1050318,4000463, 150, "纯白礼服（男）"), 
Array(1051389,4000463, 150, "纯白婚纱(女)"), 
Array(1050296,4000463, 150, "超级巨星服（男）"), 
Array(1051362,4000463, 150, "超级巨星（女）"), 
Array(1050300,4000463, 150, "蓝色雪糕帅锅装"), 
Array(1051367,4000463, 150, "蓝色雪糕MM装"), 
Array(1050145,4000463, 150, "粉露肩晚礼服（男）"), 
Array(1051123,4000463, 150, "粉露肩晚礼服（女）"), 
Array(1051372,4000463, 150, "巧克力女孩"), 
Array(1050304,4000463, 150, "巧克力男孩"), 
Array(1051368,4000463, 150, "粉格纹假日装（女）"), 
Array(1050301,4000463, 150, "蓝色格纹假日服（男）"),
Array(1000070,4000463, 150, "贵族骑手帽(男)"), 
Array(1001093,4000463, 150, "贵族骑手帽（女）"), 
Array(1050312,4000463, 150, "贵族骑手装(男)"), 
Array(1051384,4000463, 150, "贵族骑手装（女）"), 
Array(1082511,4000463, 150, "小恐龙绿豆手套"), 
Array(1082519,4000463, 150, "小恐龙云豆手套"), 
Array(1082312,4000463, 150, "彩虹护腕"), 
Array(1082493,4000463, 150, "海豹白白手套"), 
Array(1082581,4000463, 150, "巧克力发带装饰"), 
Array(1082549,4000463, 150, "咯咯嗒手套"), 
Array(1082503,4000463, 150, "圣洁天使手镯"), 
Array(1082548,4000463, 150, "星星手镯"), 
Array(1082502,4000463, 150, "蓝缎带猫咪爪"), 
Array(1072336,4000463, 150, "足球钉鞋"), 
Array(1072869,4000463, 150, "时间旅行者的高跟鞋"), 
Array(1072924,4000463, 150, "未来天使靴"), 
Array(1072913,4000463, 150, "制服皮鞋"), 
Array(1072931,4000463, 150, "爱丽丝鞋子"), 
Array(1072911,4000463, 150, "肃清者暗靴"), 
Array(1072897,4000463, 150, "蓝色鹿皮鞋"), 
Array(1072901,4000463, 150, "五彩珠鞋"), 
Array(1072876,4000463, 150, "卡卡奥熊掌鞋"), 
Array(1072917,4000463, 150, "小马乖乖鞋"), 
Array(1072662,4000463, 150, "明星闪耀"), 
Array(1072820,4000463, 150, "明星熊仔鞋"), 
Array(1102217,4000463, 150, "九尾披风")
////如需其它道具兑换，请按照此格式自行添置。
//代码,价格,介绍
);

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == -1) {
        cm.dispose();
    } else {
        if (status >= 0 && mode == 0) {
            cm.dispose();
            return;
        }
        if (mode == 1)
            status++;
        else
            status--;
        if (status == 0) {
            sl = cm.getPlayer().getItemQuantity(4000463, false);
            StringS = "#b#n角色剩余:#v4000463# x " + sl + " 枚!\r\n";
            for (var i = 0; i < ItemId.length; i++) {
                StringS += "\r\n#L" + i + "##b" + 红色箭头 + "#z" + ItemId[i][0] + "##k = #r#z " + ItemId[i][1] + " ##k X#e" + ItemId[i][2] + "#n个";
            }
            cm.sendSimple(StringS,2);
            zones == 0;

        } else if (status == 1) {
            if (zones == 1) {
                cm.sendNext("你让我帮你做什么呢？", 2);
                zones = 2;
            } else if (zones == 0) {
                if (cm.getPlayer().getInventory(net.sf.cherry.client.MapleInventoryType.getByType(1)).isFull())
                {
                    cm.sendOk("您至少应该让装备栏空出一格");
                    cm.dispose();
                } else if (cm.haveItem(ItemId[selection][2], ItemId[selection][3])) {
                    cm.gainItem(ItemId[selection][0], 1);
                    cm.gainItem(ItemId[selection][1], 1);
                    cm.gainItem((ItemId[selection][2]), -(ItemId[selection][3]));
                    cm.sendOk("兑换成功，请检背包!");
                    cm.dispose();
                } else {
                    cm.sendOk("不足！！");
                    cm.dispose();
                }
            }
        } else if (status == 2) {
            if (zones == 2) {
                cm.sendNext("我用于提升我魔法的时间之石被一群蘑菇妖偷走了,你能帮去抢回来吗？");
                zones = 3;
            }
        } else if (status == 3) {
            if (zones == 3) {
                cm.sendNext("行,这个没问题？你告诉我那些偷了你时间之石的蘑菇妖现在在什么地方呢?", 2);
                zones = 4;
            }
        } else if (status == 4) {
            if (zones == 4) {
                cm.sendNext("这个物品是#b全世界掉落#k的。你可以在世界上的#b任何一个怪物#k上获取！");
                zones = 5;
            }
        } else if (status == 5) {
            if (zones == 5) {
                cm.sendYesNo("如果你能帮我这个大忙的话,我会给你一些丰厚的奖励的，您是否愿意帮我？");
            }
        } else if (status == 6) {
            cm.setBossLog('MogoQuest');
            cm.gainItem(5220001, 1);
            cm.sendOk("非常感谢！获得后和我说话，就能换购物品了！");
            cm.dispose();
        }
    }
}	