

function start() { 
   cm.sendOk("以下為 法師技能書 掉落怪物 \r\n#b魔法反射20 怪物:海怒斯、雙刀龍戰士\r\n#r魔法反射30 怪物:多多、海怒斯\r\n#b核爆術20 怪物:海怒斯、黑翼龍\r\n#r核爆術30 怪物:海怒斯、泰勒熊、娃娃獅王\r\n#b魔力無限20 怪物:拉圖斯\r\n#r魔力無限30 怪物:殘暴炎魔\r\n#b劇毒麻痺20 怪物:幼年龍、噴火龍、洞穴幼年龍\r\n#r劇毒麻痺30 怪物:待增加\r\n#b閃電連擊20 怪物:致命烏賊怪、格瑞芬多\r\n#r閃電連擊30 怪物:待增加\r\n#b聖盾護鎧20 怪物:化石龍長老、泰勒熊、娃娃獅王\r\n#r聖盾護鎧30 怪物:噴火龍\r\n#b炎靈地獄20 怪物:噴火龍、雙刀龍戰士\r\n#r炎靈地獄30 怪物:拉圖斯\r\n#b召喚冰魔20 怪物:幼龍保護者\r\n#r召喚冰魔30 怪物:忘卻的祭司\r\n#b火流星20 怪物:殘暴炎魔\r\n#r火流星30 怪物:闇黑龍王\r\n#b寒冰地獄20 怪物:尖鼻鯊魚、格瑞芬多\r\n#r寒冰地獄30 怪物:拉圖斯、萊伊卡\r\n#b召喚火炎神20 怪物:幼年龍、洞穴幼年龍\r\n#r召喚火炎神30 怪物:待增加\r\n#b暴風雪20 怪物:忘卻的守護兵、殘暴炎魔\r\n#r暴風雪30 怪物:闇黑龍王\r\n#b天怒20 怪物:殘暴炎魔\r\n#r天怒30 怪物:闇黑龍王\r\n#b天使之箭20 怪物:化石龍、回憶的祭司\r\n#r天使之箭30 怪物:拉圖斯")

} 

