function start() {
   cm.sendOk("以下為 盜賊技能書 掉落怪物\r\n#b瞬身迴避20 怪物:海怒斯、黑翼龍\r\n#r瞬身迴避30 怪物:多多、悔恨的神官、海怒斯\r\n#b飛毒殺20 怪物:拉圖斯、雙刀龍戰士\r\n#r飛毒殺30 怪物:悔恨的祭司、殘暴炎魔\r\n#b挑釁20 怪物:幼龍保護者、利里諾斯、噴火龍、石化戰士\r\n#r挑釁30 怪物:不明\r\n#b忍影瞬殺20 怪物:海怒斯、維京\r\n#r忍影瞬殺30 怪物:海怒斯、克雷塞爾\r\n#b三飛閃20 怪物:殘暴炎魔\r\n#r三飛閃30 怪物:闇黑龍王\r\n#b忍術風影20 怪物:化石龍\r\n#r忍術風影30 怪物:不明\r\n#b無形鏢20 怪物:進化迅猛龍\r\n#r無形鏢30 怪物:忘卻的神官、拉圖斯、克雷塞爾、泰勒熊、娃娃獅王\r\n#b瞬步連擊20 怪物:化石龍長老、萊伊卡\r\n#r瞬步連擊30 怪物:拉圖斯\r\n#b致命暗殺20 怪物:幼年龍、格瑞芬多、洞穴幼年龍\r\n#r致命暗殺30 怪物:忘卻的守護隊長\r\n#b煙霧彈20 怪物:殘暴炎魔、泰勒熊、娃娃獅王\r\n#r煙霧彈30 怪物:闇黑龍王")
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 1)
			status++;
		else
			status--;
}
}