function start() {
   cm.sendOk("以下為 海盜技能書 掉落怪物\r\n#b魔龍降臨20 怪物:海怒斯、維京\r\n#r魔龍降臨30 怪物:烏賊怪、噴火龍、泰勒熊、娃娃獅王\r\n#b元氣彈20 怪物:利里諾斯、海怒斯、進化迅猛龍、狂暴者\r\n#r元氣彈30 怪物:格瑞芬多、短刃龍戰士\r\n#b閃-爆破20 怪物:尖鼻鯊魚、格瑞芬多、洞穴幼年龍\r\n#r閃-爆破30 怪物:拉圖斯\r\n#b閃-索命20 怪物:拉圖斯\r\n#r閃-索命30 怪物:泰勒熊、娃娃獅王\r\n#b閃-連殺20 怪物:多多、海怒斯、藍色雙角龍\r\n#r閃-連殺30 怪物:拉圖斯\r\n#b時間置換20 怪物:殘暴炎魔、泰勒熊、娃娃獅王\r\n#r時間置換30 怪物:闇黑龍王\r\n#b瞬-冰火連擊20 怪物:海怒斯、獨角迅猛龍\r\n#r瞬-冰火連擊30 怪物:杜庫\r\n#b海鷗特戰隊20 怪物:殘暴炎魔\r\n#r海鷗特戰隊30 怪物:闇黑龍王\r\n#b瞬-迅雷20 怪物:噴火龍、雙刀龍戰士\r\n#r瞬-迅雷30 怪物:鯊魚\r\n#b海盜加農炮20 怪物:格瑞芬多、黑翼龍\r\n#r海盜加農炮30 怪物:赤翼龍、萊伊卡、騎士熊、泰勒熊、娃娃獅王\r\n#b海盜魚雷20 怪物:化石龍長老、拉圖斯\r\n#r海盜魚雷30 怪物:海怒斯、暗黑三角龍\r\n#b心靈控制20 怪物:拉圖斯、蒙特雷瑟、石化戰士\r\n#b精準砲擊20 怪物:幼龍保護者、海怒斯\r\n#b鬥神降世20 怪物:噴火龍、藍翼龍\r\n#b砲台章魚王20 怪物:致命烏賊怪、海怒斯")
}
function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 1)
			status++;
		else
			status--;
}
}