/*

    点卷抽奖在此修改，9310100_1修改纪念币修改。金币修改在：9310100_2


*/


var aaa ="#fUI/UIWindow.img/PvP/Scroll/enabled/next2#";
var item = new Array(	// 奖品
							3010000,//休闲椅
							3010002,//蓝色木椅
							3010002,//绿色时尚转椅
							3010004,//黄蓝休闲椅
							3010005,//红蓝休闲椅
							3010006,//黄色时尚转椅

							3010008,//蓝色海豹靠垫
							3010009,//榻榻凳
							4000463,//国庆纪念币
							3010012,//剑士 宝座
							3010013,//悠长假期

							4000463,//国庆纪念币
							1322031,//葵花宝典
							1432008,//海神叉
							1402044,//南瓜灯笼
							1432009,//木精灵枪
							1302021,//橡皮榔头
							1002181,//红海盗头巾
							1002392,//海盗头巾（红）
							1002393,//海盗头巾（粉）
							4000463,//国庆纪念币
							1102040,//浪人披风（黄）
							1102043,//浪人披风（褐）
							1082002,//工地手套
							1082145,//工地手套（黄）
							1082146,//工地手套（红）
							1082147,//工地手套（蓝）
							1082148,//工地手套（紫）
							1082149,//工地手套（褐）
							1082002,//工地手套
							1082150,//工地手套（灰）
							1040135,//肌肉人

							2040804,//手套攻击卷60%
							2043001,//单手剑攻击卷60%
							2043101,//单手斧攻击卷60%
							2043201,//单手钝器攻击卷60%
							2043300,//短剑攻击卷60%
							1082002,//工地手套
							2044001,//双手剑攻击卷60%
							2044101,//双手斧攻击卷轴60%
							2044200,//双手钝器攻击卷轴60%
							2044301,//枪攻击卷轴60%
							2044401,//矛攻击卷轴60%
							2044501,//弓攻击卷轴60%
							2044601,//弩攻击卷轴60%
							2044701,//拳套攻击卷轴60%
							1082002,//工地手套
							2043701,//短杖魔力卷轴60%
							2043801,//长杖魔力卷轴60%
							1070000,//轻便鞋
							1070002,//日式木屐
							1070004,//高脚登山靴(蓝)
							1062107,//明星长裤
							1060113,//海员裤
							1052000,//褐色纸箱
							1002569,//蜡烛头
							1002204,//红雨帽
							2000004,//特殊药水
							2000005,//超级药水

			                                2040301,//耳环智力卷轴 60
			                                2040302,//耳环智力卷轴 10
			                                2040304,//耳环智力诅咒卷轴70
			                                2040305,//耳环智力诅咒卷轴30
			                                2040306,//耳环敏捷卷轴70
			                                2040307,//耳环敏捷卷轴30
                                                        2040406,//上衣力量卷轴70%
			                                2040407,//上衣力量卷轴30
			                                2040410,//上衣运气诅咒卷轴70%
			                                2040411,//上衣运气诅咒卷轴30%
			                                2040501,//全身铠甲敏捷卷轴60
			                                2040509,//全身铠甲敏捷卷轴30
			                                2040513,//全身铠甲智力卷轴60
			                                2040518,//全身铠甲智力卷轴70
			                                2040519,//全身铠甲智力卷轴30
			                                2040610,//裤裙敏捷诅咒卷轴70
			                                2040611,//裤裙敏捷诅咒卷轴30
			                                2043005,//单手剑攻击诅咒卷轴30
			                                2044005,//双手剑攻击诅咒卷轴30
			                                2044305,//枪攻击诅咒卷轴30
			                                2044405,//矛攻击诅咒卷轴30
			                                2044505,//弓攻击诅咒卷轴30
			                                2044605,//弩攻击诅咒卷轴30
			                                2044705,//拳套攻击诅咒卷轴30
			                                1032004,//金耳环
			                                1032005,//红十字耳环
			                                1032006,//雷电耳环
			                                1032007,//祖母綠耳环
			                                1032008,//猫眼耳环
			                                1032009,//黄方耳环
			                                1032012,//骷髅耳环
			                                1032025,//叶子耳环
			                                1032028,//红水晶耳环
			                                1032035,//枫叶耳环
			                                1032040,//枫叶型耳环
			                                1032047,//可乐耳环
			                                1032055,//工作人员C的旧收信机
			                                1032056,//工作人员C的旧收信机
			                                1032057,//工作人员C的旧收信机
			                                1032058,//工作人员C钛质收信机
			                                1002019,//白头巾
			                                1002020,//红星头巾
			                                1002021,//诺曼头盔
			                                1002023,//枪骑士头盔
			                                1002024,//祖母綠武士头盔
			                                1002033,//狗皮帽
			                                1002039,//青铜头盔
			                                1002040,//锂矿帽
			                                1002041,//黄色金属头箍
			                                1002051,//青铜头盔
			                                1002052,//锂矿头盔
			                                1002053,//绿色皮帽
			                                1002054,//红色皮帽
			                                1002419,//枫叶帽
			                                1002424,//红马术帽
			                                1002425,//蓝马术帽
			                                1002436,//长老斯坦之帽
			                                1002441,//热血头带
			                                1002448,//紫色头巾
			                                1002583,//蝙蝠客头套
			                                1002609,//兔耳魔法帽
			                                1102000,//绿色冒险披风
			                                1102001,//蓝色冒险披风
			                                1102002,//红色冒险披风
			                                1102147,//玩具匠人披风
			                                1102174,//工作人员披风
			                                1102166,//枫叶披风
			                                1082000,//钢制短手套
			                                1082008,//铁制轻便手套
			                                1082009,//钢铁合金手套
			                                1082031,//黑短指手套
			                                1082032,//青铜飞侠手套
			                                1082033,//锂矿飞侠手套
			                                1082034,//黑飞侠手套
			                                1082035,//黄轻便手套
			                                1082036,//黑轻便手套
			                                1082037,//青铜精神手套
			                                1082038,//锂矿精神手套
			                                1082039,//黑精神手套
			                                1082042,//钢铁暴风手套
			                                1082043,//银暴风手套
			                                1082044,//黄金暴风手套
			                                1082045,//黄金追击手套
			                                1082046,//钢铁追击手套
			                                1082047,//紫矿追击手套
			                                1082048,//褐击中手套
			                                1082049,//绿击中手套
			                                1082050,//黑击中手套

			                                1302016,//黄色雨伞
			                                1302017,//蓝色雨伞
			                                1302019,//无名剑
			                                1302020,//枫叶战剑
			                                1302021,//橡皮榔头
			                                1302022,//竹刀
			                                1302024,//废报纸卷
			                                1302025,//红雨伞
			                                1302050,//战剑
			                                1302058,//冒险岛伞
			                                1302060,//战剑

			                                1312002,//镰刀
			                                1312012,//乾坤圈
			                                1312013,//判官笔
			                                1322000,//铁瓜锤
			                                1322001,//锤子
			                                1322002,//钢锤
			                                1322003,//棒棒果
			                                1322004,//奇型锤
			                                1322005,//棍棒
			                                1322006,//钢管
			                                1322007,//皮制手提包
			                                1322008,//007提包
			                                1322009,//马桶吸
			                                1322010,//方形铁铲
			                                1322011,//三角铁铲
			                                1322071,//采矿铁锹
			                                1332000,//三角刃
			                                1332001,//半月刃
			                                1332031,//龙刃
			                                1332032,//圣诞树
			                                1332033,//水晶刃
					                1332034,//破碎刃
			                                1372008,//金属短杖
			                                1372012,//水晶短杖
			            	                1372013,//竹杖
		                          	        1372017,//领路灯
			                                1382005,//祖母綠长杖
			                                1382006,//白龙之杖
			                                1382015,//毒蘑菇
			                                1402006,//高原之剑

			                                1402044,//南瓜灯笼
			                                1412000,//双手斧

			                                1412001,//铁斧
			                                1412002,//钢铁斧
			                                1412003,//太阳之斧
			                                1422004,//板手
			                                1422005,//黄金锤
			                                1422006,//十字镐
			                                1422007,//巨人锤
			                                1422008,//大锤

			                                1422036,//玩具匠人的锤子
			                                1432000,//长枪
			                                1432001,//叉枪
			                                1432002,//三支枪
			                                1432003,//刺枪
		                         	        1432005,//双天戟
			                                1432008,//海神叉
			                                1432009,//木精灵枪
			                                1442003,//斧戟
			                                1442004,//拖把
			                                1442006,//蓝铁锤
			                                1442007,//幻影
			                                1442011,//冲浪板
			                                1442012,//天空雪板
			                                1442013,//沧海雪板
		                        	        1442014,//银雪板
			                                1442015,//黄金雪板
			                                1442016,//黑雪板
		                        	        1442017,//赤血雪板
			                                1442018,//冻冻鱼
		                        	        1442054,//红色滑水板
			                                1442055,//绿色滑水板
			                                1442065,//蓝色冲浪板
			                                1452016,//漂云之弓
		                        	        1462000,//山羊弩
			                                1462001,//弩弓
			                                1462002,//战斗弩弓
			                                1462003,//猎弩弓
			                                1462003,//猎弩弓
			                                1462004,//鹰弩
			                                1462005,//双弦弩
			                                1462006,//白银弩
			                                1462014,//枫叶玉弩
		                          	        1472054,//信玄
		                          	        1462033,//山羊弩
	                          		        1472003,//黄金拳套
		                          	        1472010,//朱矿斗拳
	                          		        1472011,//青铜守护拳套
	                          		        1702138,//大火腿

	                          		        2000004,//特殊药水
	                          		        2000005,//超级药水			
	                          		        3010007,//粉色海狗靠垫
	                          		        3010008,//蓝色海狗靠垫
                          			        3010009,//榻榻凳
                          			        3010010,//白玉海豹靠垫
                          		  	        3010016,//黑色海狗靠垫
       		                          	        3010017,//金色海狗靠垫
			                                3010024,//玩具粉熊椅
							3010034,//悠长假期   红色   
							3010035,// 悠长假期   蓝色

			                                2040613,//裤裙敏捷卷轴60%
			                                2040704,//鞋子跳跃卷轴60
			                                2040705,//鞋子跳跃卷轴10
			                                2040715,//鞋子跳跃卷轴30
			                                2040804,//手套攻击卷轴60
			                                2040811,//手套攻击卷轴30
			                                2040810,//手套攻击卷轴70
			                                2040805,//手套攻击卷轴10
			                                2040816,//手套魔力卷轴10%
			                                2040817,//手套魔力卷轴60%
			                                2040815,//手套魔力卷轴30%
			                                2040922,//盾牌魔力诅咒卷轴30%
			                                2040919,//盾牌魔力诅咒卷轴60%
			                                2040921,//盾牌魔力诅咒卷轴70%
			                                2040914,//盾牌攻击卷轴60%
			                                2040916,//盾牌攻击卷轴70%
			                                2040917,//盾牌攻击诅咒卷轴30%
			                                2041013,//披风力量卷轴60
			                                2041016,//披风智力卷轴60
			                                2041019,//披风敏捷卷轴60
			                                2041022,//披风运气卷轴60
							1082002,//工地手套
							5150040,//皇家理发券
							1302119,//企鹅王的弯刀
							1312045,//企鹅王的大斧
							1322073,//企鹅王的骑士锤
							1332088,//企鹅王的暗影刃
							1382070,//企鹅王的翡翠之杖
							1402064,//企鹅王的高原之剑
							1432057,//企鹅王的刺枪
							1442082,//企鹅王的斧戟
							1452073,//企鹅王的火焰之弓
							1462066,//企鹅王的鹰弩
							1472089,//企鹅王的黑守护拳套
							3010068,//露水椅子
							3010145,//6周年庆水晶枫叶椅子
							3010029,//蓝环凳
							3010030,//黑环凳
							3010031,//红环凳
							3010032,//黄环凳
							3010033,//绿环凳
							1002418//废报纸头盔
							);


							
function start() {
	status = -1;
	
	action(1, 0, 0);
}

function action(mode, type, selection) {
            if (mode == -1) {
                cm.dispose();
            }
            else {
                if (status >= 0 && mode == 0) {
			cm.dispose();
			return;                    
                }
                if (mode == 1) {
			status++;
		}
		else {
			status--;
		}
		        if (status == 0) {
					selStr = "\t\t#e#r金币和点卷都可以在我这里抽取各种奖品哟。#n#k\r\n";
					selStr +="#d(PS：请注意自己背包每一栏位保留一个空位，否则无法获得)\r\n\\r\n";
					selStr += "#d当前点卷: #r" + cm.getPlayer().getNX() + " #d点。\t#d当前金币：#r"+ cm.getPlayer().getMeso() +" #d金#k\r\n\r\n"
					selStr += "#L0##r"+aaa+" 点卷抽奖 [1000点卷一次]#k#l\r\n\r\n";
					selStr += "#L1##b"+aaa+" 金币抽奖 [100万金币一次]#k#l\r\n\r\n";
					//selStr += "#L2##r"+aaa+" 物品抽奖 [需要国庆纪念币三枚]#k#l\r\n\r\n";
					cm.sendSimple(selStr);
			} else if (status == 1) {
			if (selection == 0) {
                    var chance = Math.floor(Math.random()*item.length);
					var ii = net.sf.cherry.server.MapleItemInformationProvider.getInstance();
                    if (cm.getPlayer().getNX() >= 1000) {
                     cm.gainNX(-1000);
                     cm.gainItem(item[chance],1); //
                     cm.sendOk("恭喜您成功抽中#r#z"+item[chance]+"##k一个。");
                     cm.serverNotice("『点卷抽奖』 : 恭喜 " + cm.getChar().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.");
                     cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.cherry.tools.MaplePacketCreator.serverNotice(11,cm.getC().getChannel(),"『点卷抽奖』" + " : 恭喜 " + cm.getPlayer().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.",true).getBytes());
					cm.dispose();
				} else {
					cm.sendOk("#b失败：#k\r\n\r\n1. 你没有足够的点卷。\r\n#r2. 请确保背包每一栏位都有一个空位置。"); 
					cm.dispose();  
				}	
			} else if (selection == 1) {
	            /*var chance = Math.floor(Math.random()*item.length);
					var ii = net.sf.cherry.server.MapleItemInformationProvider.getInstance();
                    if (cm.getMeso() >= 1000000) {
                     cm.gainMeso(-1000000);
                     cm.gainItem(item[chance],1); //
                     cm.sendOk("恭喜您成功抽中#r#z"+item[chance]+"##k一个。");
                     cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.cherry.tools.MaplePacketCreator.serverNotice(11,cm.getC().getChannel(),"『金币抽奖』" + " : 恭喜 " + cm.getPlayer().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.",true).getBytes());
                     cm.serverNotice("『金币抽奖』 : 恭喜 " + cm.getChar().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.");
					cm.dispose();
				} else {
					cm.sendOk("#b失败：#k\r\n\r\n1. 你没有足够的金币。\r\n#r2. 请确保背包每一栏位都有一个空位置。"); // 判断需要的物品 */
				        cm.dispose(); 
                                        cm.openNpc(9310100,2);		
			} else if (selection == 2) {
                    /*var chance = Math.floor(Math.random()*item.length);
					var ii = net.sf.cherry.server.MapleItemInformationProvider.getInstance();
                    if (cm.haveItem(4000463) == 3) { // 判断需要的物品
                     cm.gainItem(4000463, -3);   // 扣除需要的物品
                     cm.gainItem(item[chance],1); //
                     cm.sendOk("恭喜您成功抽中#r#z"+item[chance]+"##k一个。");
                     //cm.serverNotice("『纪念币抽奖』 : 恭喜 " + cm.getChar().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.");
                     //cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.cherry.tools.MaplePacketCreator.serverNotice(11,cm.getC().getChannel(),"『纪念币抽大奖』" + " : 恭喜 " + cm.getPlayer().getName() + " 抽中 "+ ii.getName(item[chance]) +" 一个.",true).getBytes());
					cm.dispose();
				} else {
					cm.sendOk("#b失败：#k\r\n\r\n1. 你没有足够的物品，需要 #i4000463# x 3个。\r\n#r2. 请确保背包每一栏位都有一个空位置。"); // 判断需要的物品不足*/
					cm.dispose();  
					cm.openNpc(9310100,1);
				}
			}
		}
	}