//load("nashorn:mozilla_compat.js");

importPackage(Packages.java.util);
importPackage(Packages.client);
importPackage(Packages.server);


var aaa = "#fUI/UIWindow.img/Quest/icon9/0#";
var zzz = "#fUI/UIWindow.img/Quest/icon8/0#";
var sss = "#fUI/UIWindow.img/QuestIcon/3/0#";
var item;


var jmsz = Array(
    Array(1052997, 1500, "未定义", "永久"), //北极保暖套服 
    Array(1053006, 1500, "未定义", "永久"), //暖绒兔长裙
    Array(1052948, 1500, "未定义", "永久"), //奥尔卡的睡袍
    Array(1052940, 1500, "未定义", "永久"), //春日阳光套衫
    Array(1052925, 1500, "未定义", "永久"), //红粉飘飘连衣裙
    Array(1052924, 1500, "未定义", "永久"), //贵族花纹套服
    Array(1052923, 1500, "未定义", "永久"), //黑猫连帽衫
    Array(1052921, 1500, "未定义", "永久"), //蓝色金鱼全身服
    Array(1052922, 1500, "未定义", "永久"), //红色金鱼全身服
    Array(1052919, 1500, "未定义", "永久"), //西红柿外套
    Array(1052910, 1500, "未定义", "永久"), //水晶喵喵全身服
    Array(1052911, 1500, "未定义", "永久"), //水晶喵喵连衣裙
    Array(1052912, 1500, "未定义", "永久"), //夹棉时尚王
    Array(1052916, 1500, "未定义", "永久"), //弓凛的花衣裳
    Array(1052917, 1500, "未定义", "永久"), //红月的夜行衣
    Array(1052909, 1500, "未定义", "永久"), //蜜蜂外套
    Array(1052903, 1500, "未定义", "永久"), //白色管家礼服
    Array(1052901, 1500, "未定义", "永久"), //时髦的领结套服
    Array(1052899, 1500, "未定义", "永久"), //红色啵啵鼠连帽套服（黑色）
    Array(1052900, 1500, "未定义", "永久"), //红色啵啵鼠连帽套服（红色）
    Array(1052892, 1500, "未定义", "永久"), //呆萌兔背带裤
    Array(1052896, 1500, "未定义", "永久"), //可爱小绵羊服
    Array(1052865, 1500, "未定义", "永久"), //小恐龙套服
    Array(1052595, 1500, "未定义", "永久"), //小恐龙套服
    Array(1052852, 1500, "未定义", "永久"), //暴走斯乌连身服
    Array(1052853, 1500, "未定义", "永久"), //奥尔卡的病号服
    Array(1052850, 1500, "未定义", "永久"), //毛绒鼠鼠服
    Array(1052841, 1500, "未定义", "永久"), //甜柿服
    Array(1052842, 1500, "未定义", "永久"), //萌犬套装(裙)
    Array(1052843, 1500, "未定义", "永久"), //萌犬套装(裤)
    Array(1052844, 1500, "未定义", "永久"), //微笑玉米背带裤
    Array(1052845, 1500, "未定义", "永久"), //宽松运动服
    Array(1052846, 1500, "未定义", "永久"), //桃太郎的背带裤
    Array(1052781, 1500, "未定义", "永久"), //红色小马憨憨背带裤
    Array(1052782, 1500, "未定义", "永久"), //蓝色小马憨憨背带裤
    Array(1052772, 1500, "未定义", "永久"), //2014制服
    Array(1052762, 1500, "未定义", "永久"), //香蕉背带套装
    Array(1052754, 1500, "未定义", "永久"), //嘟嘟熊连体衣
    Array(1052726, 1500, "未定义", "永久"), //僵尸新娘全身装
    Array(1052727, 1500, "未定义", "永久"), //快乐连体衫
    Array(1052728, 1500, "未定义", "永久"), //快乐连衣裙
    Array(1052731, 1500, "未定义", "永久"), //黑色可爱游泳服
    Array(1052724, 1500, "未定义", "永久"), //小马乖乖套服
    Array(1052697, 1500, "未定义", "永久"), //雪之女神连身裙
    Array(1052675, 1500, "未定义", "永久"), //万圣节幻影帽子套服
    Array(1052671, 1500, "未定义", "永久"), //特大号白衬衫
    Array(1052661, 1500, "未定义", "永久"), //小鸡玩偶服
    Array(1052666, 1500, "未定义", "永久"), //巧克力绵羊玩偶服
    Array(1052667, 1500, "未定义", "永久"), //小绵羊朵朵玩偶服
    Array(1052656, 1500, "未定义", "永久"), //白天鹅芭蕾服
    Array(1052657, 1500, "未定义", "永久"), //黑天鹅芭蕾服
    Array(1052626, 1500, "未定义", "永久"), //海洋风条纹装
    Array(1052603, 1500, "未定义", "永久"), //武陵武道馆道服
    Array(1052601, 1500, "未定义", "永久"), //废都高校校服
    Array(1052587, 1500, "未定义", "永久"), //小海豹玩偶服
    Array(1052586, 1500, "未定义", "永久"), //伶俐猫咪服装
    Array(1052549, 1500, "未定义", "永久"), //[MS特制]红勇士马甲
    Array(1052536, 1500, "未定义", "永久"), //水手装
    Array(1052537, 1500, "未定义", "永久"), //超级星光蜜蜂服
    Array(1052539, 1500, "未定义", "永久"), //蓝道袍
    Array(1052503, 1500, "未定义", "永久"), //凉爽夏日全身装
    Array(1052474, 1500, "未定义", "永久"), //阴阳师的礼服
    Array(1052449, 1500, "未定义", "永久"), //时尚香肠套服
    Array(1052410, 1500, "未定义", "永久"), //粉嫩花仙裙
    Array(1052412, 1500, "未定义", "永久"), //淘气王子
    Array(1052419, 1500, "未定义", "永久"), //粉娃娃裙
    Array(1052356, 1500, "未定义", "永久"), //军队TOP星星
    Array(1052370, 1500, "未定义", "永久"), //格莱特服
    Array(1052346, 1500, "未定义", "永久"), //雪花情侣男棉衣
    Array(1052346, 1500, "未定义", "永久"), //雪花情侣女棉衣
    Array(1052340, 1500, "未定义", "永久"), //理科麻辣老师
    Array(1052298, 1500, "未定义", "永久"), //兔耳洛莉塔套服
    Array(1052291, 1500, "未定义", "永久"), //户外运动装
    Array(1052290, 1500, "未定义", "永久"), //唤灵斗师套装
    Array(1052286, 1500, "未定义", "永久"), //飞行猫猫服
    Array(1052275, 1500, "未定义", "永久"), //皇家彩虹夹克
    Array(1052248, 1500, "未定义", "永久"), //暗影双刀套服
    Array(1052245, 1500, "未定义", "永久"), //小嫩叶套服
    Array(1052253, 1500, "未定义", "永久"), //青草背带裤套装
    Array(1052229, 1500, "未定义", "永久"), //中国娃娃旗袍
    Array(1052225, 1500, "未定义", "永久"), //暗夜娃娃服
    Array(1052216, 1500, "未定义", "永久"), //嫦娥裙
    Array(1052209, 1500, "未定义", "永久"), //皇家海军制服
    Array(1052200, 1500, "未定义", "永久"), //罗丽粉色娃娃套服
    Array(1052201, 1500, "未定义", "永久"), //闪亮水手外套
    Array(1052135, 1500, "未定义", "永久"), //半人马装
    Array(1052085, 1500, "未定义", "永久"), //肚兜（红色）
    Array(1052086, 1500, "未定义", "永久"), //肚兜（蓝色）
    Array(1052078, 1500, "未定义", "永久"), //泡泡袍
    Array(1052067, 1500, "未定义", "永久"), //木乃伊服
    Array(1051456, 1500, "未定义", "永久"), //爱情蓝鸟连衣裙
    Array(1051457, 1500, "未定义", "永久"), //海军风校服
    Array(1051459, 1500, "未定义", "永久"), //农夫甜心派
    Array(1051464, 1500, "未定义", "永久"), //天蓝微笑裙
    Array(1051454, 1500, "未定义", "永久"), //小粉粉全身服
    Array(1051453, 1500, "未定义", "永久"), //小熊连衣裙
    Array(1051452, 1500, "未定义", "永久"), //橘色小短裙
    Array(1051448, 1500, "未定义", "永久"), //莲花学院指定校服
    Array(1051441, 1500, "未定义", "永久"), //精灵兔小妹
    Array(1051440, 1500, "未定义", "永久"), //人鱼传说
    Array(1050371, 1500, "未定义", "永久"), //人鱼传说
    Array(1051434, 1500, "未定义", "永久"), //花叶甜甜
    Array(1051435, 1500, "未定义", "永久"), //星光长袍女孩
    Array(1051426, 1500, "未定义", "永久"), //幻象贝拉
    Array(1051430, 1500, "未定义", "永久"), //闪耀之星纪念套服
    Array(1051425, 1500, "未定义", "永久"), //蝴蝶结黄色连衣裙
    Array(1051424, 1500, "未定义", "永久"), //圣诞女孩子服
    Array(1051407, 1500, "未定义", "永久"), //冒险岛学院女泳衣
    Array(1051408, 1500, "未定义", "永久"), //蝴蝶之恋套服
    Array(1051410, 1500, "未定义", "永久"), //森林露营服
    Array(1051415, 1500, "未定义", "永久"), //拉拉队服
    Array(1051389, 1500, "未定义", "永久"), //纯白婚纱
    Array(1051366, 1500, "未定义", "永久"), //黄色驯师服装
    Array(1051200, 1500, "未定义", "永久"), //邦妮女孩套服
    Array(1051192, 1500, "未定义", "永久"), //海洋裹裹短裙
    Array(1051180, 1500, "未定义", "永久"), //水兵服
    Array(1050384, 1500, "未定义", "永久"), //小蓝蓝全身服
    Array(1050387, 1500, "未定义", "永久"), //海军风校服
    Array(1050389, 1500, "未定义", "永久"), //农夫甜心派
    Array(1050393, 1500, "未定义", "永久"), //天蓝微笑套服
    Array(1050364, 1500, "未定义", "永久"), //草叶甜甜
    Array(1050353, 1500, "未定义", "永久"), //法式糕点服
    Array(1050341, 1500, "未定义", "永久"), //森林露营服
    Array(1050338, 1500, "未定义", "永久"), //冒险岛学院男泳裤
    Array(1050319, 1500, "未定义", "永久"), //秋游套装
    Array(1050293, 1500, "未定义", "永久"), //海滩帅锅装
    Array(1050210, 1500, "未定义", "永久")//蓝色小背带服
    );


var jmwq = Array(
    Array(1702105, 2000, "未定义", "永久"), //通心钥匙
    Array(1702051, 2000, "未定义", "永久"), //灯笼
    Array(1702104, 2000, "未定义", "永久"), //巨无霸冰淇淋
    Array(1702374, 2000, "未定义", "永久"), //剑豪之刃
    Array(1702212, 2000, "未定义", "永久"), //异界之器
    Array(1702091, 2000, "未定义", "永久"), //网球拍
    Array(1702115, 2000, "未定义", "永久"), //玫瑰花
    Array(1702217, 2000, "未定义", "永久"), //黄鸭子游泳圈
    Array(1702228, 2000, "未定义", "永久"), //可可香蕉
    Array(1702230, 2000, "未定义", "永久"), //冰蓝雪糕
    Array(1702237, 2000, "未定义", "永久"), //千年白狐
    Array(1702256, 2000, "未定义", "永久"), //风灵使者娃娃
    Array(1702257, 2000, "未定义", "永久"), //魂骑士娃娃
    Array(1702258, 2000, "未定义", "永久"), //炎术士娃娃
    Array(1702259, 2000, "未定义", "永久"), //奇袭者娃娃
    Array(1702260, 2000, "未定义", "永久"), //夜行者娃娃
    Array(1702261, 2000, "未定义", "永久"), //樱花棒
    Array(1702194, 2000, "未定义", "永久"), //圣火火炬
    Array(1702288, 2000, "未定义", "永久"), //豹弩游侠弩
    Array(1702318, 2000, "未定义", "永久"), //暮光雷光剑
    Array(1702319, 2000, "未定义", "永久"), //苹果绿雷光剑
    Array(1702317, 2000, "未定义", "永久"), //血红宝石雷光剑
    Array(1702320, 2000, "未定义", "永久"), //蓝灰闪电雷光剑
    Array(1702321, 2000, "未定义", "永久"), //黑暗中子星雷光剑
    Array(1702322, 2000, "未定义", "永久"), //固态黑色雷光剑
    Array(1702323, 2000, "未定义", "永久"), //翁布拉&鲁切雷光剑
    Array(1702186, 2000, "未定义", "永久"), //迪波
    Array(1702209, 2000, "未定义", "永久"), //驯鹿拐杖
    Array(1702204, 2000, "未定义", "永久"), //日本铁扇
    Array(1702203, 2000, "未定义", "永久"), //万圣节泰迪熊
    Array(1702150, 2000, "未定义", "永久"), //冰凌刀
    Array(1702149, 2000, "未定义", "永久"), //熔岩刀
    Array(1702157, 2000, "未定义", "永久"), //火烤棉花糖
    Array(1702161, 2000, "未定义", "永久"), //凶恶的狗狗
    Array(1702136, 2000, "未定义", "永久"), //雪之花
    Array(1702120, 2000, "未定义", "永久"), //比耶莫特的剑
    Array(1702118, 2000, "未定义", "永久"), //亚努斯的剑
    Array(1702119, 2000, "未定义", "永久"), //夏奇尔的剑
    Array(1702296, 2000, "未定义", "永久"), //溜溜球
    Array(1702285, 2000, "未定义", "永久"), //蓝色蝴蝶结手提包
    Array(1702302, 2000, "未定义", "永久"), //杯具
    Array(1702208, 2000, "未定义", "永久"), //搞怪鳄鱼
    Array(1702305, 2000, "未定义", "永久"), //胡萝卜武器
    Array(1702310, 2000, "未定义", "永久"), //星光魔法棒
    Array(1702374, 2000, "未定义", "永久"), //剑豪之刃
    Array(1702306, 2000, "未定义", "永久"), //花风芭蕉扇
    Array(1702379, 2000, "未定义", "永久"), //阿拉伯魔术洋灯
    Array(1702378, 2000, "未定义", "永久"), //国庆闪亮之光
    Array(1702263, 2000, "未定义", "永久"), //小灰灰猫
    Array(1702308, 2000, "未定义", "永久"), //魔术师帽子
    Array(1702298, 2000, "未定义", "永久"), //暗影刀子
    Array(1702291, 2000, "未定义", "永久"), //玲珑扇
    Array(1702293, 2000, "未定义", "永久"), //秋天旅行者背包
    Array(1702299, 2000, "未定义", "永久"), //可爱巧克力棒
    Array(1702300, 2000, "未定义", "永久"), //电蚊拍
    Array(1702328, 2000, "未定义", "永久"), //粉红天使注射器
    Array(1702329, 2000, "未定义", "永久"), //喜欢草莓
    Array(1702233, 2000, "未定义", "永久"), //彩虹毛笔
    Array(1702187, 2000, "未定义", "永久"), //蓝色极光
    Array(1702188, 2000, "未定义", "永久"), //粉色极光
    Array(1702193, 2000, "未定义", "永久"), //湿抹布
    Array(1702248, 2000, "未定义", "永久"), //圣诞武器
    Array(1702252, 2000, "未定义", "永久"), //鹰的飞舞
    Array(1702276, 2000, "未定义", "永久"), //天际之弓
    Array(1702283, 2000, "未定义", "永久"), //天界圣战手镯
    Array(1702279, 2000, "未定义", "永久"), //天界圣战之剑
    Array(1702280, 2000, "未定义", "永久"), //天界圣战巨剑
    Array(1702281, 2000, "未定义", "永久"), //天界圣战法杖
    Array(1702282, 2000, "未定义", "永久"), //天界圣战藏弓
    Array(1702362, 2000, "未定义", "永久"), //我的好友品克缤
    Array(1702324, 2000, "未定义", "永久"), //冲击波
    Array(1702323, 2000, "未定义", "永久"), //鲁切雷光剑
    Array(1702313, 2000, "未定义", "永久"), //橙色极光
    Array(1702314, 2000, "未定义", "永久"), //天堂极光
    Array(1702315, 2000, "未定义", "永久"), //斯泰拉极光
    Array(1702316, 2000, "未定义", "永久"), //动态极光
    Array(1702295, 2000, "未定义", "永久"), //扑克牌
    Array(1702348, 2000, "未定义", "永久"), //雪片
    Array(1702274, 2000, "未定义", "永久"), //神龙手套
    Array(1702301, 2000, "未定义", "永久")//兔兔魔力棒
    );


var jzmp = Array(
    Array(1112197, 1500, "未定义", "永久"), //钻石聊天戒指
    Array(1115010, 1500, "未定义", "永久"), //钻石聊天戒指
    Array(1112198, 1500, "未定义", "永久"), //黄金聊天戒指
    Array(1115011, 1500, "未定义", "永久"), //小熊猫聊天戒指
    Array(1112199, 1500, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1115015, 1500, "未定义", "永久"), //蝙蝠聊天戒指
    Array(1112144, 1500, "未定义", "永久"), //虎喵名片戒指
    Array(1112256, 1500, "未定义", "永久"), //虎喵聊天戒指
    Array(1112120, 1500, "未定义", "永久"), //可乐(White) 名片戒指
    Array(1112230, 1500, "未定义", "永久"), //可乐(White)聊天戒
    Array(1112272, 1500, "未定义", "永久"), //西瓜物语聊天戒指
    Array(1112160, 1500, "未定义", "永久"), //西瓜物语名片戒指
    Array(1112268, 1500, "未定义", "永久"), //猪猪聊天戒指
    Array(1112156, 1500, "未定义", "永久"), //猪猪名片戒指
    Array(1112267, 1500, "未定义", "永久"), //青蛙聊天戒指
    Array(1112155, 1500, "未定义", "永久"), //青蛙名片戒指
    Array(1112277, 1500, "未定义", "永久"), //绿光森林聊天戒指
    Array(1112165, 1500, "未定义", "永久"), //绿光森林名片戒指
    Array(1112270, 1500, "未定义", "永久"), //我爱胡子聊天戒指(红色)
    Array(1112158, 1500, "未定义", "永久"), //我爱胡子名片戒指(红色)
    Array(1112269, 1500, "未定义", "永久"), //我爱胡子聊天戒指(蓝色)
    Array(1112157, 1500, "未定义", "永久"), //我爱胡子名片戒指(蓝色)
    Array(1112253, 1500, "未定义", "永久"), //木乃伊聊天戒指
    Array(1112142, 1500, "未定义", "永久"), //木乃伊名片戒指
    Array(1112257, 1500, "未定义", "永久"), //浪漫花边聊天戒指
    Array(1112145, 1500, "未定义", "永久"), //浪漫花边名片戒指
    Array(1112258, 1500, "未定义", "永久"), //青苹果之恋聊天戒指
    Array(1112146, 1500, "未定义", "永久"), //青苹果之恋名片戒指
    Array(1112263, 1500, "未定义", "永久"), //美味蛋糕聊天戒指
    Array(1112151, 1500, "未定义", "永久"), //美味蛋糕名片戒指
    Array(1112171, 1500, "未定义", "永久"), //狗狗名片戒指
    Array(1112172, 1500, "未定义", "永久"), // 狗狗名片戒指
    Array(1112173, 1500, "未定义", "永久"), //奶白兔名片戒指
    Array(1112285, 1500, "未定义", "永久"), //奶白兔LT戒指
    Array(1112174, 1500, "未定义", "永久"), //足球聊天戒指
    Array(1112175, 1500, "未定义", "永久"), //足球MP戒指
    Array(1112176, 1500, "未定义", "永久"), //旋律戒指
    Array(1112288, 1500, "未定义", "永久"), //旋律戒指
    Array(1112177, 1500, "未定义", "永久"), //进击聊天戒指
    Array(1112289, 1500, "未定义", "永久"), //进击聊天戒指
    Array(1112283, 1500, "未定义", "永久"), //GG聊天戒指
    Array(1112171, 1500, "未定义", "永久"), //GG聊天戒指
    Array(1112284, 1500, "未定义", "永久"), //GG聊天戒指
    Array(1112172, 1500, "未定义", "永久"), //GG聊天戒指
    Array(1112290, 1500, "未定义", "永久"), //MH聊天戒指
    Array(1112178, 1500, "未定义", "永久"), //MH聊天戒指
    Array(1112291, 1500, "未定义", "永久"), //XH聊天戒指
    Array(1112179, 1500, "未定义", "永久"), //XH聊天戒指
    Array(1112190, 1500, "未定义", "永久"), //AC聊天戒指
    Array(1115003, 1500, "未定义", "永久"), //AC聊天戒指
    Array(1112191, 1500, "未定义", "永久"), //MF聊天戒指
    Array(1115004, 1500, "未定义", "永久"), //MF聊天戒指
    Array(1112192, 1500, "未定义", "永久"), //BL聊天戒指
    Array(1115005, 1500, "未定义", "永久"), //BL聊天戒指
    Array(1112237, 1500, "未定义", "永久"), //小竹林聊天戒指
    Array(1112134, 1500, "未定义", "永久")//小竹林名片戒指
    );

var tjId = Array(
    Array(1702301, 1500, "未定义", "永久"),//兔兔魔力棒
    Array(1102665, 1500, "未定义", "永久"), //狐狸围脖
    Array(1002960, 1500, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1051295, 3000, "未定义", "永久"), //魔法裙装
    Array(3010163, 2000, "未定义", "10天", 60000 * 60 * 24 * 10, 1)//满月椅子
    );

var syxh = Array(
    Array(2340000, 1500, "未定义", 1), //祝福卷轴
    Array(2049100, 1500, "未定义", 1) //混沌卷轴60%
    );

var tscl = Array(
    Array(4000151, 1000, 100), //时间门神的轴标
    Array(4001109, 1000, 5)//强化玻璃瓶
    );

var xswp = Array(
    Array(5000191, 5000, "神马", 60000 * 60 * 90 * 1, 1),
    Array(5000212, 5000, "火红小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000213, 5000, "幽青小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000214, 5000, "雷黄小恶魔", 60000 * 60 * 90 * 1, 1),
    Array(5000244, 5000, "冰龙", 60000 * 60 * 90 * 1, 1),
    Array(5000013, 3000, "大象", 60000 * 60 * 90 * 1, 1),
    Array(5000014, 3000, "圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000055, 5000, "水晶银圣诞鹿", 60000 * 60 * 90 * 1, 1),
    Array(5000053, 10000, "大猩猩机器人", 60000 * 60 * 90 * 1, 1),
    Array(5000038, 3000, "萌太郎", 60000 * 60 * 90 * 1, 1),
    Array(5000072, 3000, "臭鼬", 60000 * 60 * 90 * 1, 1),
    Array(5000075, 3000, "小象宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000076, 5000, "威尔士柯基狗", 60000 * 60 * 90 * 1, 1),
    Array(5000077, 8000, "波斯猫", 60000 * 60 * 90 * 1, 1),
    Array(5000081, 3000, "飞行小鲸鱼", 60000 * 60 * 90 * 1, 1),
    Array(5000084, 3000, "独角兽安塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000085, 3000, "蛋糕宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000086, 3000, "馅饼宝宝", 60000 * 60 * 90 * 1, 1),
    Array(5000089, 3000, "独角兽迪埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000090, 3000, "独角兽吉尼", 60000 * 60 * 90 * 1, 1),
    Array(5000091, 3000, "独角兽埃塞尔", 60000 * 60 * 90 * 1, 1),
    Array(5000096, 3000, "稀有白色小象", 60000 * 60 * 90 * 1, 1),
    Array(5000250, 3000, "粉小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000251, 3000, "蓝小熊", 60000 * 60 * 90 * 1, 1),
    Array(5000252, 3000, "艾克索", 60000 * 60 * 90 * 1, 1),
    Array(5000253, 5000, "阿黛尔", 60000 * 60 * 90 * 1, 1),
    Array(5000264, 5000, "跳跳袋鼠", 60000 * 60 * 90 * 1, 1),
    Array(5000271, 3000, "绿色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000272, 3000, "黄色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000273, 3000, "粉色考拉", 60000 * 60 * 90 * 1, 1),
    Array(5000274, 3000, "豆豆蛇", 60000 * 60 * 90 * 1, 1),
    Array(5000284, 5000, "冰骑士", 60000 * 60 * 90 * 1, 1),
    Array(5000287, 5000, "血腥皇后", 60000 * 60 * 90 * 1, 1),
    Array(5000288, 5000, "半半", 60000 * 60 * 90 * 1, 1),
    Array(5000289, 5000, "皮埃尔", 60000 * 60 * 90 * 1, 1),
    Array(5000290, 3000, "天使提尔", 60000 * 60 * 90 * 1, 1),
    Array(5000291, 3000, "天使拉尔", 60000 * 60 * 90 * 1, 1),
    Array(5000292, 3000, "天使米尔", 60000 * 60 * 90 * 1, 1),
    Array(5000293, 3000, "蜜桃鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000294, 3000, "薄荷鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000295, 3000, "紫色鲁提", 60000 * 60 * 90 * 1, 1),
    Array(5000320, 5000, "铠鼠爱因", 60000 * 60 * 90 * 1, 1),
    Array(5000321, 5000, "铠鼠居里", 60000 * 60 * 90 * 1, 1),
    Array(5000322, 5000, "铠鼠牛顿", 60000 * 60 * 90 * 1, 1),
    Array(5000324, 30000, "火柴人宠物", 60000 * 60 * 90 * 1, 1),
    Array(5000330, 5000, "MINI班雷昂", 60000 * 60 * 90 * 1, 1),
    Array(5000331, 5000, "MINI奥尔卡", 60000 * 60 * 90 * 1, 1),
    Array(5000332, 5000, "MINI希拉", 60000 * 60 * 90 * 1, 1),
    Array(5000369, 5000, "小拉伊", 60000 * 60 * 90 * 1, 1),
    Array(5000370, 5000, "小波波", 60000 * 60 * 90 * 1, 1),
    Array(5000371, 5000, "小阿尔", 60000 * 60 * 90 * 1, 1),
    Array(5000391, 5000, "黄金虾", 60000 * 60 * 90 * 1, 1),
    Array(5000528, 5000, "猫鼬家族", 60000 * 60 * 90 * 1, 1),
    Array(5000402, 10000, "芭蕾女孩丽恩", 60000 * 60 * 90 * 1, 1)
    );


var jmpf = Array(
    Array(1102665, 1000, "未定义", "永久"), //狐狸围脖
    Array(1102217, 1000, "未定义", "永久"), //九尾披风
    Array(1102625, 1000, "未定义", "永久"), //红色蜗牛壳
    Array(1102187, 1000, "未定义", "永久"), //金色狐狸尾巴
    Array(1102648, 1000, "未定义", "永久"), //K君的猫尾巴
    Array(1102387, 1000, "未定义", "永久"), //海龙尾巴
    Array(1102388, 1000, "未定义", "永久"), //炎龙尾巴
    Array(1102292, 1000, "未定义", "永久"), //尾巴
    Array(1102296, 1000, "未定义", "永久"), //夜叉尾巴（黑色）
    Array(1102656, 1000, "未定义", "永久"), //动物尾巴6
    Array(1102622, 1000, "未定义", "永久"), //时间旅行者的怀表
    Array(1102692, 1000, "未定义", "永久"), //寿司团
    Array(1102574, 1000, "未定义", "永久"), //小鸡叽叽叽
    Array(1102380, 1000, "未定义", "永久"), //我的朋友青蛙酱
    Array(1102549, 1000, "未定义", "永久"), //管家的猫咪
    Array(1102705, 1000, "未定义", "永久"), //企鹅书包
    Array(1102683, 1000, "未定义", "永久"), //兔兔熊背包
    Array(1102684, 1000, "未定义", "永久"), //未来医生听诊器
    Array(1102682, 1000, "未定义", "永久"), //未来天使注射器
    Array(1102593, 1000, "未定义", "永久"), //浮漾的翅膀
    Array(1102668, 1000, "未定义", "永久"), //夜天使之翼
    Array(1102353, 1000, "未定义", "永久"), //自由的翅膀
    Array(1102554, 1000, "未定义", "永久"), //女妖之翼
    Array(1102391, 1000, "未定义", "永久"), //小蜜蜂翅膀
    Array(1102325, 1000, "未定义", "永久"), //紫天使羽翼
    Array(1102326, 1000, "未定义", "永久"), //蓝天使羽翼
    Array(1102389, 1000, "未定义", "永久"), //金色天使
    Array(1102390, 1000, "未定义", "永久"), //银色天使
    Array(1102273, 1000, "未定义", "永久"), //路西法之翼
    Array(1102349, 1000, "未定义", "永久"), //发光精灵翅膀
    Array(1102293, 1000, "未定义", "永久"), //羁绊之翼
    Array(1102152, 1000, "未定义", "永久"), //黑骷髅海盗旗
    Array(1102300, 1000, "未定义", "永久"), //派对舞会灯
    Array(1102288, 1000, "未定义", "永久"), //背背雪人
    Array(1102274, 1000, "未定义", "永久"), //刺柏刀
    Array(1102310, 1000, "未定义", "永久"), //精灵披风
    Array(1102461, 1000, "未定义", "永久"), //粉嫩披风
    Array(1102222, 1000, "未定义", "永久"), //死神披风
    Array(1102583, 1000, "未定义", "永久"), //宝贝龙波比
    Array(1102232, 1000, "未定义", "永久"), //小王子的星星
    Array(1102218, 1000, "未定义", "永久"), //仙女飘飘
    Array(1102356, 1000, "未定义", "永久"), //天使祖母绿
    Array(1102270, 1000, "未定义", "永久"), //风和日丽
    Array(1102261, 1000, "未定义", "永久"), //音符围脖
    Array(1102251, 1000, "未定义", "永久"), //世界杯手巾
    Array(1102373, 1000, "未定义", "永久"), //露西娅披风
    Array(1102301, 1000, "未定义", "永久"), //旅行者披风
    Array(1102255, 1000, "未定义", "永久"), //唤灵斗师披风
    Array(1102254, 1000, "未定义", "永久"), //豹弩游侠披风
    Array(1102242, 1000, "未定义", "永久"), //胡克的船长披风
    Array(1102249, 1000, "未定义", "永久"), //奥兹魔法披风
    Array(1102239, 1000, "未定义", "永久"), //暗影双刀披风
    Array(1102355, 1000, "未定义", "永久"), //怪盗幻影披风
    Array(1102673, 1000, "未定义", "永久"), //僵尸新娘披风
    Array(1102324, 1000, "未定义", "永久"), //传说双层气球
    Array(1102212, 1000, "未定义", "永久"), //丢失的小孩
    Array(1102233, 1000, "未定义", "永久"), //雪娃娃披风
    Array(1102230, 1000, "未定义", "永久"), //企企雪橇披风
    Array(1102245, 1000, "未定义", "永久"), //太阳披风
    Array(1102258, 1000, "未定义", "永久"), //玩具熊气球
    Array(1102215, 1000, "未定义", "永久"), //气球串
    Array(1102271, 1000, "未定义", "永久"), //可爱巧克力棒气球
    Array(1102488, 1000, "未定义", "永久"), //蛋糕杯气球
    Array(1102285, 1000, "未定义", "永久"), //晴天娃娃(粉色)
    Array(1102286, 1000, "未定义", "永久"), //晴天娃娃(天蓝色)
    Array(1102287, 1000, "未定义", "永久")//晴天娃娃(淡黄色)
    );


var jmmz = Array(
    Array(1002960, 1500, "未定义", "永久"), //暗夜娃娃皇冠
    Array(1004639, 1500, "未定义", "永久"), //北极罩帽
    Array(1004665, 1500, "未定义", "永久"), //暖绒兔兔帽
    Array(1004638, 1500, "未定义", "永久"), //茅山道士帽
    Array(1004592, 1500, "未定义", "永久"), //紫色时间
    Array(1004592, 1500, "未定义", "永久"), //粉色时间
    Array(1004590, 1500, "未定义", "永久"), //蓝莓宝石头饰
    Array(1004589, 1500, "未定义", "永久"), //侠盗猫眼罩
    Array(1004570, 1500, "未定义", "永久"), //黑色海魂帽
    Array(1004571, 1500, "未定义", "永久"), //海贼团贝雷帽
    Array(1004541, 1500, "未定义", "永久"), //茶会大蝴蝶结
    Array(1004540, 1500, "未定义", "永久"), //奥尔卡的睡帽
    Array(1004506, 1500, "未定义", "永久"), //白色兔耳发带
    Array(1004504, 1500, "未定义", "永久"), //贵族花纹帽子
    Array(1004499, 1500, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004500, 1500, "未定义", "永久"), //蓝色金鱼帽子
    Array(1004491, 1500, "未定义", "永久"), //西红柿帽子
    Array(1004481, 1500, "未定义", "永久"), //反抗者护目镜
    Array(1004480, 1500, "未定义", "永久"), //小淘气的飞行帽
    Array(1004470, 1500, "未定义", "永久"), //毛绒雷锋帽
    Array(1004469, 1500, "未定义", "永久"), //爱情宣言
    Array(1004463, 1500, "未定义", "永久"), //方块兔帽子
    Array(1004448, 1500, "未定义", "永久"), //黑色啵啵鼠帽
    Array(1004414, 1500, "未定义", "永久"), //热腾腾包子帽
    Array(1004409, 1500, "未定义", "永久"), //松鼠的休闲帽
    Array(1004403, 1500, "未定义", "永久"), //嘻哈兔子
    Array(1004405, 1500, "未定义", "永久"), //睡虎休闲帽
    Array(1004397, 1500, "未定义", "永久"), //清扫头巾
    Array(1004336, 1500, "未定义", "永久"), //暴走斯乌假发
    Array(1004332, 1500, "未定义", "永久"), //我爱小狗
    Array(1004330, 1500, "未定义", "永久"), //奢华羊绒小礼帽
    Array(1004328, 1500, "未定义", "永久"), //粉色棒球帽
    Array(1004329, 1500, "未定义", "永久"), //蓝色棒球帽发夹
    Array(1004324, 1500, "未定义", "永久"), //防毒面罩
    Array(1004294, 1500, "未定义", "永久"), //甜柿帽
    Array(1004295, 1500, "未定义", "永久"), //音乐飞天小鸡帽
    Array(1004296, 1500, "未定义", "永久"), //萌动飞天小鸡帽
    Array(1004298, 1500, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004299, 1500, "未定义", "永久"), //泰迪萌犬帽(白)
    Array(1004275, 1500, "未定义", "永久"), //幸运帽
    Array(1004269, 1500, "未定义", "永久"), //苹果蒂风情帽
    Array(1004239, 1500, "未定义", "永久"), //桃太郎帽子
    Array(1004212, 1500, "未定义", "永久"), //晶莹精致丝带
    Array(1004211, 1500, "未定义", "永久"), //哈尼绒绒耳
    Array(1004204, 1500, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004205, 1500, "未定义", "永久"), //蓝色小马憨憨针织帽
    Array(1004202, 1500, "未定义", "永久"), //隐武士战盔
    Array(1004200, 1500, "未定义", "永久"), //夏日兔草帽
    Array(1004198, 1500, "未定义", "永久"), //太极发箍
    Array(1004196, 1500, "未定义", "永久"), //风车头箍
    Array(1004194, 1500, "未定义", "永久"), //蝴蝶结贝雷帽
    Array(1004169, 1500, "未定义", "永久"), //美味荷包蛋帽
    Array(1004171, 1500, "未定义", "永久"), //旋转木马帽
    Array(1004163, 1500, "未定义", "永久"), //爱丽丝表丝带
    Array(1004158, 1500, "未定义", "永久"), //鼠鼠派对发箍
    Array(1004137, 1500, "未定义", "永久"), //兔兔熊帽
    Array(1004025, 1500, "未定义", "永久"), //绿猫猫帽子
    Array(1004026, 1500, "未定义", "永久"), //黑猫无边帽
    Array(1004027, 1500, "未定义", "永久"), //白猫无边帽
    Array(1004028, 1500, "未定义", "永久"), //黄猫无边帽
    Array(1004029, 1500, "未定义", "永久"), //北极熊无边帽
    Array(1004033, 1500, "未定义", "永久"), //红猫猫帽子
    Array(1004003, 1500, "未定义", "永久"), //粉红猫耳套头帽
    Array(1004004, 1500, "未定义", "永久"), //粉红猫耳套头帽
    Array(1003967, 1500, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003968, 1500, "未定义", "永久"), //巧克力绵羊玩偶帽
    Array(1003951, 1500, "未定义", "永久"), //欧黛特头箍
    Array(1003952, 1500, "未定义", "永久"), //欧黛特头箍
    Array(1003937, 1500, "未定义", "永久"), //浪漫斗笠
    Array(1003919, 1500, "未定义", "永久"), //花花绒线帽
    Array(1003920, 1500, "未定义", "永久"), //夏威夷草帽
    Array(1003921, 1500, "未定义", "永久"), //咕噜噜鸭舌帽
    Array(1003917, 1500, "未定义", "永久"), //粉红太阳镜帽
    Array(1003900, 1500, "未定义(1004571, 1500, "鏈